import folium    #η βιβλιοθήκη που χρειαζόμαστε ώστε να δημιουργηθεί ο χάρτης
map=folium.Map(location=[36.98579580051849, 26.97858449353227], zoom_start=3)

#δημιουργία του χάρτη με αρχικές συντεταγμένες ώστε να εμφανίζεται όσο πιο κεντρικά γίνεται

folium.Marker([40.62663356517188, 22.948361325012304], #οι συντεταγμένες που βρίσκεται το μνημείο
              popup="<h1> Λευκός Πύργος </h1><img src='whitetower.jpg' width=400px><p> Ο Λευκός Πύργος της Θεσσαλονίκης είναι οχυρωματικό έργο\n"
                    "οθωμανικής κατασκευής του 15ου αιώνα (χτίστηκε πιθανόν μεταξύ 1450-70). Σήμερα θεωρείται χαρακτηριστικό μνημείο\n"
                    "της Θεσσαλονίκης και είναι ό,τι έχει σωθεί από την κατεδαφισμένη οθωμανική οχύρωση της πόλης. Η σημερινή μορφή του πύργου\n"
                    "αντικατέστησε βυζαντινή οχύρωση του 12ου αιώνα για να χρησιμοποιηθεί στη συνέχεια ως κατάλυμα φρουράς Γενιτσάρων και ως\n"
                    "φυλακή θανατοποινιτών. Σήμερα λειτουργεί ως μουσείο και είναι ένα από τα πιο γνωστά κτίσματα-σύμβολα πόλεων στην Ελλάδα.\n"
                    "Έχει 6 ορόφους, 34 μέτρα ύψος και 70 μέτρα περίμετρο.Ο Λευκός Πύργος έχει θέα την παραλία της Θεσσαλονίκης.\n"
                    "Κατά την Τουρκοκρατία έγιναν προσθήκες και τροποποιήσεις στα τείχη της πόλης, στα οποία εντάσσεται και ο Λευκός Πύργος, μαζί με το\n"
                    " Επταπύργιο και τον Πύργο της Αλύσεως ή Πύργο Τριγωνίου (ο τελευταίος χρονολογείται κατά τον 16ο αιώνα). Δεν είναι γνωστό πότε\n"
                    "ακριβώς χτίστηκε, στη θέση προϋπάρχοντος βυζαντινού πύργου ο οποίος συνέδεε το ανατολικό τμήμα της οχύρωσης της Θεσσαλονίκης\n"
                    "(που σώζεται και σήμερα), με το θαλάσσιο (το οποίο κατεδαφίστηκε το 1867). Παλιότερα επικρατούσε η άποψη πως ήταν έργο των\n"
                    "Βενετών αλλά πλέον η σύγχρονη ιστοριογραφία δέχεται το κτίσμα ως οθωμανικό. Κατά μία εκδοχή, η χρονολογία κατασκευής\n"
                    "του μνημείου τοποθετείται περί το 1450 με 1470, λίγα χρόνια μετά την άλωση της Θεσσαλονίκης από τους Τούρκους (1430) και πρόκειται\n"
                    " για ένα από τα πρωιμότερα δείγματα οθωμανικής οχυρωματικής που λαμβάνει υπόψη της το πυροβολικό. Έχει διατυπωθεί η υπόθεση πως\n"
                    " αρχιτέκτονας του Πύργου ήταν ο φημισμένος Μιμάρ Σινάν, βάσει της ομοιότητας με ανάλογο πύργο στην Αυλώνα της Αλβανίας, ο οποίος\n"
                    "κτίστηκε τη δεκαετία του 1530. Χρονολόγηση κορμών ξύλου που χρησιμοποιήθηκαν στο Λευκό Πύργο έδειξε ότι κόπηκαν το έτος 1535 αλλά\n"
                    "υπάρχει η πιθανότητα οι κορμοί να χρησιμοποιήθηκαν σε εκτεταμένη επισκευή του μνημείου. Όλα αυτά δείχνουν τις δυσκολίες στη\n"
                    "χρονολόγηση μνημείων της οθωμανικής στρατιωτικής αρχιτεκτονικής της εποχής της Αναγέννησης. Γύρω από τον πύργο υπήρχε χαμηλός\n"
                    "οκταγωνικός περίβολος (προτείχισμα) με τρεις επίσης οκταγωνικούς πύργους, το οποίο κατεδαφίστηκε στις αρχές του 20ου αι. Ο\n"
                    " περίβολος αυτός χρησίμευε κυρίως για να προστατεύει τον Πύργο από τη θάλασσα αλλά θεωρείται πιθανή η χρήση του και για την\n"
                    "τοποθέτηση βαρέων πυροβόλων τα οποία θα έλεγχαν την ακτογραμμή και το λιμάνι. Επειδή πολύ συχνά η όψη του Πύργου βαφόταν με\n"
                    " αίμα και υπήρχαν πολλά θύματα από Οθωμανούς βασανιστές και εκτελεστές αλλά και εκτελέσεις των φυλακισμένων από τους Γενίτσαρους,\n"
                    " εκείνη την περίοδο μέχρι και το τέλος του 19ου αιώνα ο Πύργος είχε ονομαστεί «Πύργος του Αίματος». Όταν οι Ελληνες κατέλαβαν τη\n"
                    " Θεσσαλονίκη το 1912 κατά τη διάρκεια του Α’ Βαλκανικού Πολέμου, ο Πύργος είχε λευκό χρώμα, όπως και ονομάστηκε, γεγονός που\n"
                    "συμβόλιζε τον καθαρισμό </p>").add_to(map)
#Ανάμεσα στα tags <h>...</h> προσθέτουμε τον τίτλο που θέλουμε να εμφανίζεται για το μνημείο. Με το image src='' θέτουμε την εικόνα που θέλουμε να εμφανίζεται
#ανάμεσα στα tags <p>...</p> προσθέτουμε το κείμενο που θέλουμε να εμφανίζεται στο σώμα του κειμένου. Εξ ορισμού το marker έχει μπλέ χρώμα.
#Όλες οι προσθήκες ακολουθούν αυτό τον τρόπο. Εφεξής για την αποφυγή συνωστισμού, θα υπάρχουν σχόλια όπου υπάρχουν διαφορές σε σχέση με τον τρόπο αυτό

folium.Marker([-22.95170846815443, -43.21053013684409],
          popup="<h2> Χριστός Λυτρωτής </h2><img src='christredeemer.jpg' width=400px><p> Το Άγαλμα του Χριστού Λυτρωτή (Cristo Redentor στα πορτογαλικά)\n"
                " είναι ψηλό άγαλμα, το οποίο εικονίζει τον Ιησού Χριστό με απλωμένα τα χέρια και βρίσκεται στην κορυφή του λόφου Κορκοβάντο (Corcovado)\n"
                ", πάνω από το Ρίο ντε Τζανέιρο, στο εθνικό πάρκο του Δάσους Τιζούκα (Tijuca). Στέκεται με απλωμένα τα χέρια σαν να καλωσορίζει τον κόσμο\n"
                ", σε ύψος 710 μέτρων. Έχει ύψος 32 μέτρα, ζυγίζει 1.000 τόνους και μάλιστα είναι εγκατεστημένο με τρόπο ώστε να ατενίζει την πόλη του Ρίο\n"
                ".Το άγαλμα θεμελιώθηκε στις 12 Οκτωβρίου 1931. Είναι χαρακτηριστικό ότι για το φωτισμό του αγάλματος του Χριστού εκείνη την ημέρα είχαν\n"
                "σχεδιάσει να ανάψει με τρόπο φαντασμαγορικό: τα φώτα θα τα άναβε ο πρωτοπόρος Γουλιέλμος Μαρκόνι από το αγκυροβολημένο σκάφος του στη\n "
                "Νάπολι της Ιταλίας. Θα έστελνε ηλεκτρικό σήμα σε ένα σταθμό στο Ντόρτσεστερ της Αγγλίας και αυτό με τη σειρά του θα μεταφερόταν σε μια\n "
                "κεραία στο Jacarepagua στο Ρίο, απ' όπου θα άναβαν τα φώτα του αγάλματος. Ωστόσο, ο καιρός δεν βοήθησε, το σήμα ήταν αδύναμο, και τα φώτα \n"
                "τα άναψαν οι τεχνικοί του Ρίο. </p>").add_to(map)

folium.Marker([43.87918429387513, -103.45907586345582],
              popup="<h3> Όρος Rushmore </h3><img src='rushmore.jpg' width=400px><p> Το Εθνικό Μνημείο του Όρους Ράσμορ (Mount Rushmore National Memorial)\n"
                    "βρίσκεται στην Νότια Ντακότα των Η.Π.Α. Πρόκειται για τις μορφές τεσσάρων προέδρων των Η.Π.Α., ύψους 18 μέτρων, τις οποίες σκάλισαν\n"
                    "σε μια γρανιτένια πλαγιά του όρους Ράσμορ ο γλύπτης Γκάτζον Μπόργκλουμ και ο γιος του Λίνκολν. Οι τέσσερις πρόεδροι είναι, από\n"
                    "αριστερά προς τα δεξιά: ο Τζωρτζ Ουάσινγκτον, ο Τόμας Τζέφερσον, ο Θεόδωρος Ρούζβελτ και ο Αβραάμ Λίνκολν. Η ιδέα για την κατασκευή\n"
                    "του μνημείου αποδίδεται στον ιστορικό Ντόαν Ρόμπινσον (Doane Robinson). Το μνημείο επισκέπτονται κάθε χρόνο δύο εκατομμύρια άνθρωποι.Ο\n"
                    "Ντόαν Ρόμπινσον αρχικά είχε προτείνει την περιοχή Νιντλς για την κατασκευή του μνημείου αλλά ο γλύπτης Γκάτζον Μπόργκλουμ επέλεξε το\n"
                    "όρος Ράσμορ για διάφορους λόγους. Πρώτον ήταν το ψηλότερο βουνό στην περιοχή (1.745 μ.). Δεύτερον ο γρανίτης στο Ράσμορ είναι πιο\n"
                    " λείος και ανθεκτικός και διαβρώνεται μόλις μια ίντσα (25 χιλ.) κάθε 10.000 χρόνια. Τέλος επειδή το βουνό βλέπει νοτιοανατολικά οι\n"
                    "εργάτες είχαν περισσότερο φως για να δουλέψουν. </p>").add_to(map)

folium.Marker([48.85851118771021, 2.294438369365257],
              popup="<h4> Πύργος του Άιφελ </h4><img src='eiffel.jpg' width=400px><p> Ο Πύργος του Άιφελ (γαλλικά: La Tour Eiffel),\n"
                    "είναι το σήμα κατατεθέν (τοπόσημο) της πόλης του Παρισιού που βρίσκεται στη Γαλλία. Κατασκευάστηκε το 1889 από τον μηχανικό Γουστάβο\n"
                    "Άιφελ και σήμερα αποτελεί ένα από τα γνωστότερα κτίρια στον κόσμο. Με ύψος 324 μέτρα (300 χωρίς την κεραία) ήταν το πιο ψηλό\n"
                    "κτίριο στον κόσμο μέχρι που το ξεπέρασε το Εμπάιρ Στέιτ Μπίλντινγκ της Νέας Υόρκης το 1931. Έχει βάρος 10.000 τόνους και η κατασκευή\n"
                    " του είναι τόσο σταθερή, ώστε παρεκκλίνει μόλις έως 7,5 εκατοστά με σφοδρό άνεμο.Έχει τρία επισκέψιμα επίπεδα,\n"
                    "καθένα προσβάσιμο με σκάλες ή με ανελκυστήρα. Για την άνοδο μέχρι το πρώτο επίπεδο χρειάζονται 302 βήματα (το ίδιο και για το δεύτερο)\n"
                    ". Το τρίτο και μεγαλύτερο επίπεδο είναι προσβάσιμο μόνο με τον ανελκυστήρα. Τόσο το πρώτο όσο και το δεύτερο επίπεδο διαθέτουν\n"
                    "εστιατόριο.Ο πύργος έχει χρησιμοποιηθεί επίσης και για πολλές σκηνές ταινιών του κινηματογράφου αλλά και στην τηλεόραση.</p>").add_to(map)

folium.Marker([-33.85659727934909, 151.21526451136967],
              popup="<h5> Όπερα του Σύδνευ </h5><img src='sydenyopera.jpg' width=400px><p> Η Όπερα του Σίδνεϊ (αγγλικά: Sydney Opera House)\n"
                    "είναι πολυχώρος τεχνών θεάματος στο Σίδνεϊ της Αυστραλίας. Είναι ένα από τα πιο διασημότερα κτίρια του 20ού αιώνα και\n"
                    "αποτελεί έναν από τους σημαντικότερους χώρους άσκησης τεχνών στον κόσμο. Τοποθετημένο στο σημείο Bennelong στο λιμάνι του Σίδνεϊ\n"
                    " και κοντά στην εξίσου διάσημη γέφυρά του, το κτίριο και τα περίχωρά του διαμορφώνουν μια εικονική αυστραλιανή εικόνα.\n"
                    "Είναι ένα σημαντικό τουριστικό αξιοθέατο. Εκτός από πολλά περιοδεύοντα θέατρα, μπαλέτα, και μουσικές παραγωγές, η όπερα\n"
                    "είναι το σπίτι της όπερας της Ελλάδας, θεάτρων της Αθήνας και της συμφωνικής ορχήστρας του Σύδνεϋ. Σχεδιάστηκε από τον\n"
                    "Δανό αρχιτέκτονα Γιερν Ούντσον και εγκαινιάστηκε επισήμως τις 20 Οκτωβρίου 1973. Η όπερα του Σύδνεϋ είναι ένα σύγχρονο\n"
                    "εξπρεσιονιστικό σχέδιο, με μια σειρά μεγάλων προκατασκευασμένων «κοχυλιών», που διαμορφώνει τις στέγες της δομής. Η όπερα καλύπτει\n"
                    "1.8 εκτάρια (4.5 στρέμματα) εδάφους. Έχει 183 μέτρα (605 πόδια) μήκος και περίπου 120 μέτρα (388 πόδια) πλάτος στο ευρύτερο σημείο\n"
                    " του. Υποστηρίζεται σε 580 αποβάθρες που βυθίζονται μέχρι 25 μέτρα κάτω από τη στάθμη της θάλασσας. Η παροχή ηλεκτρικού ρεύματός\n"
                    "της είναι ισοδύναμη για μια πόλη 25.000 ανθρώπων και διανέμεται από 645 χιλιόμετρα ηλεκτρικού καλωδίου.Οι στέγες καλύπτονται με 1.056\n"
                    "εκατομμύρια στιλπνά σουηδικά κεραμίδια μεταλλικού κρεμ-λευκού χρώματος, εν τούτοις από μια απόσταση τα κεραμίδια φαίνονται μόνο άσπρα\n"
                    ". Παρά την αυτοκαθαριζόμενη φύση τους, υπόκεινται ακόμα στην περιοδική συντήρηση και αντικατάσταση.Το θέατρο της όπερας και η αίθουσα\n"
                    " συναυλιών βρίσκονται στις δύο μεγαλύτερες ομάδες κοχυλιών και τα άλλα θέατρα βρίσκονται στις πλευρές των σχηματισμών ομάδας κοχυλιών\n"
                    ". Η μορφή των κοχυλιών επιλέγεται για να απεικονίσει τις εσωτερικές απαιτήσεις ύψους, που αυξάνονται από τις εισόδους, πέρα από τις\n"
                    "θέσεις και μέχρι τους υψηλούς σκηνικούς πύργους. Το εσωτερικό του κτηρίου αποτελείται από ρόδινο γρανίτη που εξάγονται από το Tarana\n"
                    "και ξύλο και κοντραπλακέ που παρέχεται από τη βόρεια Νότια Νέα Ουαλία.</p>").add_to(map)

folium.Marker([27.175316584401674, 78.04211001116343],
              popup="<h6> Τάζ Μαχάλ </h6><img src='tajmahal.jpg' width=400px><p> Το Τατζ Μαχάλ (Taj Mahal) είναι κτιριακό συγκρότημα που βρίσκεται\n"
                    "στην Ινδία, κτισμένο στη νότια όχθη του ποταμού Γιαμούνα κοντά στη πόλη Άγκρα. Το συγκρότημα αναπτύσσεται γύρω από το μαυσωλείο\n"
                    "που ανήγειρε ο Σαχ Τζαχάν Μογγόλος αυτοκράτορας (Σάχης) προκειμένου να τιμήσει τη πολυαγαπημένη του σύζυγο Μουμτάζ Μαχάλ που πέθανε\n"
                    " το 1631 κατά τη διάρκεια τοκετού. Για την ανέγερσή του, που έγινε σε σχέδια ομάδας αρχιτεκτόνων από την Ινδία, το σημερινό Πακιστάν\n"
                    " και άλλα μέρη της Ασίας, απασχολήθηκαν 20.000 εργάτες που ξεκίνησαν το 1632 δουλεύοντας καθημερινά, για να το ολοκληρώσουν το 1649\n"
                    ". Πλην όμως για να ολοκληρωθούν όλα τα κτίσματα του συγκροτήματος χρειάστηκαν 22 χρόνια. Η έκταση που καταλαμβάνει το κυρίως\n"
                    "μαυσωλείο και όλο το συγκρότημα είναι ένα ορθογώνιο με διαστάσεις 580×350 μέτρα, με τετράγωνο κήπο στο κέντρο που πλαισιώνεται\n"
                    "από δύο άλλα μικρότερα επιμήκη κτίρια προσανατολισμένα κατά διεύθυνση Βορρά - Νότου. Επί της νότιας πλευράς του όλου συγκροτήματος\n"
                    "βρίσκεται η κύρια πύλη του συγκροτήματος που είναι από ψαμμίτη. Η βόρεια πλευρά του συγκροτήματος περιλαμβάνει το Μαυσωλείο και\n"
                    "καταλήγει στην όχθη του ποταμού Γιαμούνα. Δεξιά του Μαυσωλείου έχει ανεγερθεί τζαμί και αριστερά κτίριο ομοιόμορφο με το τζαμί,\n"
                    "λεγόμενο τζαβάμπ, που διατηρεί την αισθητική αρχιτεκτονική ισορροπία. Το όλο συγκρότημα περικλείεται από ψηλό τειχικό περίβολο που\n"
                    " φέρει ανά διαστήματα οκταγωνικούς πυργίσκους. Έξω δε από τον περίβολο αυτό και προς νότο βρίσκονται τα βοηθητικά κτίσματα της φρουράς\n"
                    " καθώς και σταύλοι. </p>").add_to(map)

folium.Marker([25.197468806595715, 55.274344211121516],
              popup="<h7> Μπούρτζ Καλίφα </h7><img src='burjkhalifa.jpg' width=400px><p> Το Μπουρτζ Χαλίφα (αραβικά: برج خليفة , αγγλικά:\n"
                    "Burj Khalifa), γνωστό και ως Μπουρτζ Ντουμπάι, είναι ουρανοξύστης μέσα στην πόλη Ντουμπάι στα Ηνωμένα Αραβικά Εμιράτα και το\n"
                    " υψηλότερο κτήριο στον κόσμο, με ύψος 827 μέτρα και 160 ορόφους. Η κατασκευή του ξεκίνησε στις 21 Σεπτεμβρίου το 2004 και \n"
                    "ολοκληρώθηκε την 1 Οκτωβρίου 2009. Επισήμως, άρχισε να χρησιμοποιείται στις 5 Ιανουαρίου 2010. Το κτήριο ξεκίνησε την κατασκευή\n"
                    " του στις 21 Σεπτεμβρίου του 2004. Ο πύργος σχεδιάστηκε από την εταιρεία Skidmore, Owings and Merrill, η οποία έχει σχεδιάσει τον\n"
                    " ουρανοξύστη Γουίλις Τάουερ (πρώην Σίαρς Τάουερ) στο Σικάγο και το πρώτο Παγκόσμιο Κέντρο Εμπορίου 1, που πήρε τη θέση των Δίδυμων\n"
                    " Πύργων στην Νέα Υόρκη. Το σχέδιο το εμπνεύστηκαν από ένα φυτό που συναντάται στις ερήμους, το Hymenocallis. Την κατασκευή ανέλαβε\n"
                    " η εταιρεία Samsung Engineering & Construction, η οποία και έχει κατασκευάσει τους Πύργους Πετρόνας και τον Ταϊπέι 101, ενώ το\n"
                    " κόστος άγγιξε τα 1,2 δις ευρώ.Διαθέτει 160 ορόφους, όπου οι πιο πολλοί προορίζονται για γραφεία και διαμερίσματα. Στο μέλλον \n"
                    "θα κατοικούν και θα εργάζονται συνολικά 12.000 άνθρωποι. Επίσης, θα στεγάζεται και ένα ξενοδοχείο σχεδιασμένο από τον Τζιόρτζιο \n"
                    "Αρμάνι. Ο ουρανοξύστης, ύψους 827 μέτρων, είναι ορατός από απόσταση 100 χιλιομέτρων υπό καλές καιρικές συνθήκες. Έχει συνολικά \n"
                    "24.348 παράθυρα και το σύστημα καθαρισμού του κόστισε 8 εκ. δολάρια. Και αξιοσημείωτο είναι ότι ο υψηλότερος όροφος έχει διαφορά\n"
                    " θερμοκρασίας από τον πρώτο 6-7 βαθμούς Κελσίου.</p>").add_to(map)

folium.Marker([-13.162879987388742, -72.54500584060382],
              popup="<h8> Μάτσου Πίτσου </h8><img src='machupicchu.jpg' width=400px><p> Η αρχαία πόλη Μάτσου Πίτσου που βρίσκεται στο νότιο Περού είναι\n"
                    "το αντιπροσωπευτικότερο δείγμα του πολιτισμού των Ίνκα, που χάθηκε με απότομο τρόπο και που η εξέλιξή του ήταν και παραμένει θέμα\n"
                    "συζήτησης. Το Μάτσου Πίτσου ανακηρύχθηκε Ιστορικό Καταφύγιο του Περού το 1981 και Μνημείο Παγκόσμιας Κληρονομιάς της UNESCO το 1983.\n"
                    "[1] Επίσης, το 2007 ψηφίστηκε ως ένα από τα Νέα Επτά Θαύματα του Κόσμου σε μια παγκόσμια ψηφοφορία που διεξηχθεί στο Διαδίκτυο.Το \n"
                    "Μάτσου Πίτσου(στην ελληνική βιβλιογραφία απαντάται και ως Μάτσου Πίκτσου) στη γλώσσα Κέτσουα σημαίνει «αρχαίο βουνό». Βρίσκεται σε\n"
                    " υψόμετρο 2700 μέτρων στη Σιέρρα Βιλκαμπάμπα, στην αριστερή όχθη του παραπόταμου του Βιλκανότα, Ουρουμπάμπα. Απέχει 80 χιλιόμετρα\n"
                    " από την πόλη Κούσκο. Η περιοχή έχει πυκνή βλάστηση, με τυπική τροπική χλωρίδα, ενώ η όλη περιοχή μεταξύ της Σιέρρα και του πυκνού \n"
                    "δάσους ονομάζεται ceja de selva, δηλαδή «το φρύδι του δάσους». Η πόλη είναι χτισμένη επάνω σε μια πολύ στενή κύρτωση του ορεινού \n"
                    "όγκου της Σιέρρα και συνδέει την πόλη με τη κορυφή Χουαϊάνα Πίτσου, που σημαίνει η «νεαρή κορυφή». Παρότι οι ακραίες καιρικές και \n"
                    "κλιματολογικές συνθήκες δεν είναι χαρακτηριστικό της περιοχής, σε σύγκριση πάντα με το γενικό σύνολο των κορυφογραμμών των Άνδεων,\n"
                    " η ανθρώπινη κατοίκηση για μεγάλο χρονικό διάστημα στην πόλη Μάτσου Πίτσου, δεν είναι εφικτή. Αυτός είναι και ο κύριος λόγος που οι \n"
                    "αρχαιολόγοι δεν δέχτηκαν ότι αυτή η πόλη αποτέλεσε το τελευταίο καταφύγιο των Ίνκας στη διάρκεια της Ισπανικής κατάκτησης. </p>").add_to(map)

folium.Marker([40.432079176607, 116.57033198226354],
              popup="<h9> Σινικό Τείχος </h9><img src='chinawall.jpg' width=400px><p> Το Σινικό Τείχος είναι κινεζική οχύρωση που κατασκευάστηκε σταδιακά\n"
                    ", προκειμένου να προστατευθεί η Κίνα από τις επιδρομές μογγολικών και τουρκικών φύλων από τα βόρεια σύνορά της. Η κατασκευή του \n"
                    "ξεκίνησε σταδιακά από τον 7ο αι. π.Χ., αλλά η σημερινή του μορφή οφείλεται κυρίως στη δυναστεία Μινγκ (τέλη του 14ου αι. με \n"
                    "αρχές του 17ου αι. μ.Χ.). Το Τείχος εκτείνεται σε συνολικό μήκος 8.850 χλμ, σύμφωνα με πρόσφατη μέτρηση, αποτελούμενο από \n"
                    "6.259 χλμ πραγματικού τείχους, 359 χλμ τάφρου και 2.232 χλμ φυσικών οχυρώσεων όπως λόφοι και ποταμοί. Αποτελεί έτσι το μεγαλύτερο\n"
                    " σε διαστάσεις ανθρώπινο οικοδόμημα. Κατά άλλη σύγχρονη μέτρηση, το Σινικό Τείχος, με όλες τις διακλαδώσεις του, έχει συνολικό μήκος\n"
                    " 21.196 χιλιόμετρα. </p>").add_to(map)

folium.Marker([48.63607233087012, -1.5111055354906013],
              popup="<h10> Σάν Μισέλ </h10><img src='saintmichel.jpg' width=400px><p> Το αββαείο του Μον-Σαιν-Μισέλ βρίσκεται στην γαλλική κοινότητα\n"
                    " του Μον-Σαιν-Μισέλ, στην Νορμανδία, στον νομό της Μάγχης. Το αββαείο αποτελεί αντικείμενο μιας κατάταξης ως ιστορικό μνημείο με την\n"
                    "λίστα του 1862. Ο χώρος βρίσκεται από το 1979 στην λίστα των μνημείων παγκόσμιας κληρονομιάς της UNESCO εντός του Μον-Σαιν-Μισέλ\n"
                    "και του κόλπου του και το διαχειρίζεται το Κέντρο Εθνικών Μνημείων της Γαλλίας. </p>").add_to(map)

folium.Marker([55.75263759955709, 37.62307606936262],
              popup="<h11> Καθεδρικός Ναός Αγίου Βασιλέιου </h11><img src='saintbasil.jpg' width=400px><p> Ο Καθεδρικός Ναός της Αγίας Σκέπης της\n"
                    "Υπεραγίας Θεοτόκου επί της τάφρου (ρωσικά: Собор Василия Блаженного, επίσημη ονομασία: Собор Покрова пресвятой Богородицы, что на Рву)\n"
                    " πιο γνωστός ως Καθεδρικός Ναός του Αγίου Βασιλείου του Ευλογημένου ή Καθεδρικός του Αγίου Βασιλείου, είναι μια εκκλησία με πολλούς\n"
                    " κρεμμυδοειδείς τρούλους, η οποία βρίσκεται στην Κόκκινη Πλατεία της Μόσχας και είναι το σύμβολό της. Την ανέγερση του Καθεδρικού\n"
                    "Ναού ζήτησε ο Τσάρος Ιβάν ο Τρομερός και κτίστηκε μεταξύ των ετών 1555 και 1561 σε ανάμνηση της κατάκτησης του Χανάτου του Καζάν που\n"
                    "έγινε στις αρχές Οκτωβρίου του 1552, ακριβώς την ημέρα κατά την οποία η ορθόδοξη εκκλησία γιορτάζει την Αγία Σκέπη της Υπεραγίας\n"
                    "Θεοτόκου. Το 1588 ο Τσάρος Φιοντόρ ο Κωδωνοκρούστης προσέθεσε ένα παρεκκλήσιο στην ανατολική πλευρά του ναού, πάνω από τον τάφο του\n"
                    "Αγίου Βασιλείου του διά Χριστόν σαλού (Василий Блаженный), από τον οποίο πήρε ολόκληρος ο Καθεδρικός Ναός το όνομά του.  Ο Ναός\n"
                    " βρίσκεται στο νοτιοανατολικό άκρο της Κόκκινης Πλατείας, ακριβώς απέναντι από το Κρεμλίνο. Δεν είναι ιδιαίτερα μεγάλος και\n"
                    "αποτελείται από εννέα παρεκκλήσια, κτισμένα γύρω από ένα κεντρικό κτίριο. Η αρχική ιδέα ήταν το κάθε παρεκκλήσιο να αφιερωθεί\n"
                    "σε άγιο, στην ημέρα μνήμης του οποίου ο Τσάρος πέτυχε στρατιωτική νίκη. Οι χαρακτηριστικοί κρεμμυδόσχημοι τρούλοι του ακολουθούν\n"
                    "την παραδοσιακή ρωσική ναοδομία και σε συνδυασμό με την πολυχρωμία τους διαμορφώνεται το τελικό εντυπωσιακό σύνολο. Ο θρύλος λέει\n"
                    "ότι ο Ιβάν ο Τρομερός τύφλωσε τον αρχιτέκτονα Ποστνίκ Γιάκοβλεφ, μόλις τελείωσε ο Ναός, για να τον εμποδίσει να ξανακτίσει κάτι τόσο\n"
                    "εντυπωσιακό. Σε έναν κήπο μπροστά στο Ναό βρίσκεται ένα μπρούτζινο άγαλμα προς τιμήν των Ντμίτρι Ποζάρσκι και Κουζμά Μίνιν,\n"
                    "εθελοντών στην αντίσταση ενάντια στους εισβολείς Πολωνούς στα τέλη του 16ου και αρχές του 17ου αιώνα. Αρχικά το άγαλμα είχε στηθεί\n"
                    "στο κέντρο της Κόκκινης Πλατείας, αλλά η σοβιετική Κυβέρνηση θεώρησε ότι εμπόδιζε τις μεγαλειώδεις στρατιωτικές παρελάσεις και το\n"
                    "μετακίνησε μπροστά στο Ναό το 1936. Ο Καθεδρικός Ναός του Αγίου Βασιλείου δεν πρέπει να συγχέεται με το Κρεμλίνο. Βρίσκεται ακριβώς\n"
                    " δίπλα του, αλλά δεν αποτελεί κατά κανένα τρόπο συνέχειά του ή τμήμα του.</p>").add_to(map)

folium.Marker([37.97174816705293, 23.72578667248341],
              popup="<h12> Ακρόπολη </h12><img src='acropolis.jpg' width=400px><p> Η Ακρόπολη Αθηνών είναι βραχώδης λόφος ύψους 157 μ. από την επιφάνεια της\n"
                    "θάλασσας και 70 μ. περίπου από το επίπεδο της πόλεως των Αθηνών. Η κορυφή του έχει σχήμα τραπεζοειδές μήκους 300 μ.\n"
                    "και μέγιστου πλάτους 150 μ. Ο λόφος είναι απρόσιτος απ’ όλες τις πλευρές εκτός της δυτικής, όπου και βρίσκεται η οχυρή είσοδος,\n"
                    "η διακοσμημένη με τα λαμπρά Προπύλαια. Διαπιστώθηκε ότι ο λόφος ήταν κατοικημένος από την 3η χιλιετία π.Χ.. Εκεί υπήρχε\n"
                    "συνοικισμός καθώς επρόκειτο για φυσικό οχυρό, με πρόσβαση μόνο από τη δυτική πλευρά, ενώ η επάνω επιφάνεια του λόφου ήταν αρκετά πλατιά\n"
                    "ώστε να μπορεί να κατοικηθεί, στις πλαγιές υπήρχαν υδάτινες πηγές. Ο Θουκυδίδης μάλιστα γράφει ότι «ἡ Ἀκρόπολις ἡ νῦν οὖσα πόλις ῆν»  </p>").add_to(map)

folium.Marker([-27.101851802203278, -109.35058182461978],
              popup="<h13> Νησί του Πάσχα </h13><img src='easterisland.jpg' width=400px><p> Το Νησί του Πάσχα (ισπανικά: Isla de Pascua), και επίσης\n"
                    " Ράπα Νούι (ράπα νούι: Rapa Nui), είναι νησί της Πολυνησίας που βρίσκεται στον Ειρηνικό ωκεανό και είναι επαρχία της Χιλής.\n"
                    "Έχει έκταση 163,6 τ.χλμ. και πληθυσμό περίπου 7.750 κατοίκους στην απογραφή του 2017. Θεωρείται το πλέον απομονωμένο νησί στον\n"
                    " κόσμο. Ο γηγενής πληθυσμός αναφέρεται στο νησί ως Ραπανούι και οι Χιλιανοί ως Isla de Pascua. Το όνομα «Νησί του Πάσχα»\n"
                    "οφείλεται στον Ολλανδό θαλασσοπόρο Γιάκομπ Ρόγκεβεν, ο οποίος έφτασε εκεί το Πάσχα του 1722. Στον 20ό αιώνα χαρακτηρίζονται\n"
                    "ως σημαντικές δύο εξεγέρσεις, αυτή του 1914 και η εξέγερση του 1964 μισό αιώνα μετά. Στην πρώτη οι λιμοκτονούντες γηγενείς\n"
                    "εξεγείρονται και ζητούν να φύγουν για την Ταϊτή. Η εξέγερση δεν επιτυγχάνει. Είκοσι χρόνια αργότερα, το 1934 καταφθάνει στο\n"
                    "νησί ο Ελβετός εθνολόγος Αλφρέ Μετρό για να μελετήσει τους τοπικούς μύθους και τον κοινωνικό ιστό, γεγονός που είχε ως αποτέλεσμα\n"
                    " το έργο του για την εθνολογία της Νήσου του Πάσχα (L’Île de Pâques, 1935) σε έκδοση του Bishop Museum Press. Το 1952 το χιλιανό\n"
                    "ναυτικό κάνει την εμφάνισή του στο νησί προκειμένου να κρατήσει σε ύφεση οποιεσδήποτε τάσεις εξέγερσης. Το 1955 με την αποστολή του\n"
                    "Νορβηγού καθηγητή Τορ Χάιερνταλ γίνεται μια δεύτερη προσπάθεια μελέτης του νησιού. Μία δεκαετία αργότερα ακολουθεί δεύτερη εξέγερση\n"
                    "που έχει ως αποτέλεσμα τη διενέργεια εκλογών. Τις εκλογές, το 1964, κέρδισε ο γηγενής Ράπου, δίνοντας τέλος στην καταπίεση. Το νησί\n"
                    "συνδέθηκε αεροπορικά και εμπορικά με τον υπόλοιπο κόσμο χάρη σε αμερικανικό αεροδρόμιο και διαμετακομιστικό εμπορικό σταθμό.</p>").add_to(map)

folium.Marker([37.82009808267124, -122.47829801782245],
              popup="<h14> Γέφυρα Golden Gate </h14><img src='goldengate.jpg' width=400px><p>Η Γέφυρα Γκόλντεν Γκέιτ (αγγλ.: Golden Gate Bridge)\n"
                    "είναι κρεμαστή γέφυρα που εκτείνεται στην «Golden Gate» (Χρυσή Πύλη), το άνοιγμα του κόλπου του Σαν Φρανσίσκο στον Ειρηνικό Ωκεανό.\n"
                    " Ως μέρος και των δύο, της Διαδρομής 101 των ΗΠΑ και της Κρατικής Διαδρομής 1 της Καλιφόρνια, η δομή συνδέει την πόλη του Σαν\n"
                    "Φρανσίσκο, το βόρειο άκρο της χερσονήσου του Σαν Φρανσίσκο με την κομητεία του Μαρίν. Η Γέφυρα Γκόλντεν Γκέιτ είχε τη μεγαλύτερη\n"
                    "διάρκεια κατασκευής κρεμαστής γέφυρας στον κόσμο, όταν ολοκληρώθηκε το 1937, και έχει γίνει ένα από τα πιο διεθνώς αναγνωρισμένα\n"
                    "σύμβολα του Σαν Φρανσίσκο, της Καλιφόρνιας και των Ηνωμένων Πολιτειών. Αποτελεί τη δεύτερη μεγαλύτερη κρεμαστή γέφυρα, κυρίως στα\n"
                    "ανοίγματά της, στις Ηνωμένες Πολιτείες, μετά τη Γέφυρα Βερρατσάνο Νάροους στη Νέα Υόρκη. Έχει χαρακτηριστεί ως ένα από τα σύγχρονα\n"
                    " θαύματα του κόσμου από την Αμερικανική Εταιρεία Πολιτικών Μηχανικών και είναι ένα από τα πιο διεθνώς αναγνωρισμένα σύμβολα\n"
                    "του Σαν Φρανσίσκο και της Καλιφόρνιας. Αρχικά σχεδιάστηκε από τον μηχανικό Τζόζεφ Στράους το 1917. Ο ταξιδιωτικός οδηγός του\n"
                    " Frommer περιγράφει την Γέφυρα Γκόλντεν Γκέιτ ως «πιθανώς η πιο όμορφη και σίγουρα η πιο φωτογραφημένη, γέφυρα στον κόσμο».\n"
                    " Κατά το άνοιγμα της το 1937, ήταν και η μεγαλύτερη και η ψηλότερη κρεμαστή γέφυρα στον κόσμο, με κύριο άνοιγμα 1.280 μ. και\n"
                    "συνολικό ύψος 227 μ.</p>").add_to(map)

folium.Marker([47.55770430521583, 10.74978966902785],
              popup="<h15> Κάστρο του Νόισβανσταιν </h15><img src='germancastle.jpg' width=400px><p> Το Κάστρο Νοϊσβάνσταϊν\n"
                    "(γερμανικά: Schloss Neuschwanstein, προφέρεται: [nɔʏˈʃvaːnʃtaɪn]) είναι παλάτι του 19ου αιώνα το οποίο βρίσκεται σε λόφο πάνω\n"
                    " από το χωριό Σβάνγκαου, κοντά στο Φύσεν, στη νοτιοδυτική Βαυαρία, στη Γερμανία. Η κατασκευή του διατάχθηκε από τον Λουδοβίκο\n"
                    " Β΄ της Βαυαρίας ως χώρος ανάπαυσης και φόρος τιμής στον Ρίχαρντ Βάγκνερ. Ο Λουδοβίκος πλήρωσε για το παλάτι από τη περιουσία\n"
                    "του και από δάνεια και όχι από τα δημόσια κεφάλαια της Βαυαρίας. Το παλάτι αρχικά σχεδιαζόταν να γίνει προσωπικό καταφύγιο του\n"
                    "βασιλιά, αλλά άνοιξε στο κοινό επί πληρωμή αμέσως μετά τον θάνατό του το 1886, μη έχοντας ακόμα αποπερατωθεί. Από τότε το κάστρο\n"
                    " έχουν επισκεφθεί περισσότεροι από 60 εκατομμύρια άνθρωποι. Περισσότεροι από 1,3 εκατομμύρια άνθρωποι επισκέφτηκαν το κάστρο το\n"
                    " 2008, με έως και 6.000 επισκέπτες τη μέρα κατά τη διάρκεια του καλοκαιριού. Το παλάτι έχει εμφανιστεί σε πολλές ταινίες και\n"
                    "αποτέλεσε την έμπνευση για το κάστρο της ωραίας κοιμωμένης της Ντίσνεϋλαντ και άλλων μεταγενέστερων κατασκευών.</p>").add_to(map)

folium.Marker([43.723068283394646, 10.396596997720298],
              popup="<h16> Πύργος της Πίζας </h16><img src='isa.jpg' width=400px><p> Ο κεκλιμένος Πύργος της Πίζας (ιταλικά:Torre pendente di Pisa)\n"
                    "ή απλά ο Πύργος της Πίζας (Torre di Pisa) είναι το λεγόμενο στα ιταλικά «campanile» (καμπαναριό), ή ανεξάρτητο κωδωνοστάσιο,\n"
                    "του Καθεδρικού Ναού της Ιταλικής πόλης της Πίζας και είναι γνωστός παγκοσμίως για την ακούσια κλίση του. Βρίσκεται πίσω από τον\n"
                    "Καθεδρικό Ναό και είναι το τρίτο παλαιότερο οικοδόμημα στην Πλατεία του Ντουόμο, της Πίζας (Piazza dei Miracoli) μετά τον Καθεδρικό\n"
                    " Ναό και το κυκλικού σχήματος Βαπτιστήριο της Πίζας, ενώ δίπλα βρίσκεται και το Κοιμητήριο. Η κλίση του Πύργου άρχισε κατά τη διάρκεια\n"
                    " της κατασκευής του και οφειλόταν στην ανεπαρκή θεμελίωση πάνω στο έδαφος, καθώς ήταν πολύ μαλακό με αποτέλεσμα να αδυνατεί να\n"
                    "υποστηρίζει το βάρος της υποδομής. 'Ηδη κατά τις δεκαετίες πριν την ολοκλήρωση της κατασκευής, η κλίση αυξήθηκε και συνέχισε να\n"
                    "αυξάνεται σταδιακά μέχρι τη σταθεροποίηση του Πύργου (σύνδεση και την εν μέρει διόρθωση του) από προσπάθειες που καταβλήθηκαν στα\n"
                    "τέλη του 20ου και αρχές του 21ου αιώνα. Το ύψος του πύργου είναι 55,86 μ. (183,27 πόδια) από τη χαμηλότερη πλευρά του εδάφους\n"
                    "και 56,67 μ. (185,93 πόδια) από την υψηλότερη. Το πλάτος των τοιχωμάτων της βάσης του είναι 2,44 μ. (8ft 0.06 in) ενώ το βάρος\n"
                    "του υπολογίζεται στους 14.450 τόνους (16.000 short tons). Ο πύργος διαθέτει 296 ή 294 σκαλοπάτια καθώς ο έβδομος όροφος έχει δύο\n"
                    "λιγότερα στην βόρεια πλευρά της σκάλας. Πριν από τις εργασίες αναστήλωσης που διενεργήθηκαν μεταξύ των ετών 1990 και 2001, ο πύργος\n"
                    " είχε κλίση σε γωνία 5,5 μοιρών εν αντιθέσει με τη σημερινή κλίση του πύργου που υπολογίζεται περίπου στις 3,97 μοίρες. Αυτό σημαίνει\n"
                    " ότι η κορυφή του πύργου μετατοπίστηκε οριζόντια από το κέντρο του 3,9 μ. (12 πόδια 10 in). </p>").add_to(map)

folium.Marker([29.977593575681023, 31.132452581949693],
              popup="<h17> Πυραμίδα της Γκίζας </h17><img src='giza.jpg' width=400px><p> Οι πυραμίδες της Γκίζας είναι από τα παλαιότερα σωζόμενα\n"
                    "κτίσματα και είναι οι πιο διάσημες πυραμίδες του κόσμου. Η κατασκευή ανάγεται στο 2580 π.Χ. και βρίσκονται στη Νεκρόπολη της\n"
                    "Γκίζας. Το σύμπλεγμα πιθανολογείται ότι χρησιμοποιήθηκε για τον ενταφιασμό Φαραώ και κατασκευάστηκε από την τέταρτη δυναστεία\n"
                    "των Αιγυπτίων. Η μεγαλύτερη και πιο διάσημη είναι η πυραμίδα του Χέοπα (ή Χούφου) ενώ οι άλλες δύο είναι μικρότερες και βρίσκονται\n"
                    "κάποια μέτρα μακρύτερα από την πυραμίδα του Χέοπα. Είναι το παλαιότερο από τα επτά θαύματα του αρχαίου κόσμου. Έχει ύψος 146,60 μ.\n"
                    "και τέλεια τετράγωνη βάση με πλευρά 230,35 μ. , προκαλεί δε εντύπωση στους σύγχρονους ερευνητές για τα δεδομένα της εποχής της\n"
                    "κατασκευής της. Έχει όγκο 2.521.000 κυβικά μέτρα, καλύπτει επιφάνεια 54.000 τετραγωνικών μέτρων και το υπολογιζόμενο βάρος της\n"
                    "φθάνει τους 6,5 εκατομμύρια τόνους. Συμπεριλαμβάνονταν στα Επτά Θαύματα του κόσμου. Για την αποπεράτωσή της χρειάστηκαν 30 χρόνια\n"
                    "δουλειάς από 100.000 εργάτες-δούλους, πολλοί από τους οποίους πέθαναν κατά τη διάρκεια κατασκευής της. Το μνημείο σήμερα συγκινεί\n"
                    "τους επισκέπτες της Αιγύπτου για το μεγαλείο του και την τεχνική του και προβληματίζει τους σύγχρονους ειδικούς για το πώς μπόρεσαν\n"
                    "να λύσουν τα τόσα προβλήματα μηχανικής και στατικής οι αρχαίοι συνάδελφοί τους. Εξωτερικά, η πυραμίδα του Χέοπα είναι επιστρωμένη με\n"
                    "πλάκες από γρανίτη. Το εσωτερικό ήταν λαβύρινθος από διαδρόμους και δωματιάκια, που εμπόδιζαν την εύκολη διείσδυση στον κύριο χώρο,\n"
                    "όπου βρισκόταν η σαρκοφάγος του Φαραώ. Ο χώρος, φτιαγμένος από μαύρο βασάλτη, ἔχει ύψος 5 μ., πλάτος 5,34 μ. και μήκος 10,33 μ.\n"
                    "Η λάρνακα, μέσα στην οποία βρισκόταν η μούμια του Φαραώ, ήταν από ροζ γρανίτη. </p>").add_to(map)

folium.Marker([-17.925444319158373, 25.862409466353135],
              popup="<h18> Καταρράκτες της Βικτώρια </h18><img src='victoriafalls.jpg' width=400px><p> Οι Καταρράκτες της Βικτωρίας\n"
                    "(αγγλικά: Victoria Falls) ή Mosi-oa-Tunya ( Ο καπνός που βροντά) είναι καταρράκτες που βρίσκονται στην Αφρική, μεταξύ της Ζάμπια\n"
                    " και της Ζιμπάμπουε. Δημιουργούνται από τον ποταμό Ζαμβέζη, και αποτελούν κάποιους από τους μεγαλύτερους καταρράκτες του κόσμου.\n"
                    "Το όνομα Βικτωρίας, δόθηκε από τον Ντέιβιντ Λίβινγκστον, προς τιμή της βασίλισσας Βικτωρίας και είναι το όνομα το οποίο χρησιμοποιεί\n"
                    "επίσημα η Ζιμπάμπουε για τους καταρράκτες. Αντίθετα, η Ζάμπια χρησιμοποιεί ως επίσημο το όνομα Mosi-oa-Tunya. Το μέγιστο ύψος τους\n"
                    "φτάνει τα 108 μέτρα και το πλάτος τους τα 1708 μέτρα, ενώ ο όγκος του νερού που πέφτει φτάνει κατά μέσο όρο τα 1088 m³/s "
                    "(κυβικά μέτρα/δευτερόλεπτο). </p>").add_to(map)

folium.Marker([31.776855691019765, 35.23447631083333],
              popup="<h19> Δυτικό Τείχος </h19><img src='westwall.jpg' width=400px><p> To Δυτικό Τείχος ή Τείχος των Δακρύων\n"
                    "(εβραϊκά: הַכֹּתֶל הַמַּעֲרָבִי ,ΧαΚότελ ΧαΜαάραβιτ, αραβικά: حائط البراق, Χαΐτ Αλ-Μπουράκ) είναι τμήμα\n"
                    "του αρχαίου τείχους του όρους του Ναού και αποτελεί ίσως το πιο ιερό σημείο για τους Εβραίους εκτός του ίδιου του όρους.\n"
                    " Σύμφωνα με την εβραϊκή παράδοση, το τείχος είναι τμήμα του Δεύτερου Ναού της Ιερουσαλήμ. Βρίσκεται στη παλαιά πόλη της Ιερουσαλήμ\n"
                    ", στους ανατολικούς πρόποδες του όρους του Ναού. Το σήμερα εκτεθειμένο μέρος του τείχους στη πλατεία της εβραϊκής συνοικίας έχει\n"
                    " 19 μέτρα ύψος (από συνόλου 32 μέτρων) και 57 μέτρα μήκος. Άλλα εκτεθειμένα τμήματα είναι το νότιο τμήμα μήκους 80 μέτρων και\n"
                    "ένα κομμάτι που βρίσκεται στη μουσουλμανική συνοικία μήκους 8 μέτρων. Συνολικά, το Δυτικό Τείχος έχει μήκος 488 μέτρα. Είναι\n"
                    "κατασκευασμένο από ασβεστολιθικούς ογκόλιθους. </p>").add_to(map)

folium.Marker([55.24076386706087, -6.511658796279258],
              popup="<h20> Μονοπάτι του Γίγαντα </h20><img src='giantsway.jpg' width=400px><p> Το «μονοπάτι του γίγαντα» (giant’s causeway),\n"
                    "είναι ένα εντυπωσιακό αξιοθέατο που εντυπωσιάζει τους επισκέπτες με τις εξάγωνες  πέτρες που εφάπτονται μεταξύ τους.\n"
                    " Σε πολλά σημεία, η συμμετρία μεταξύ των βράχων είναι τέτοια, που δύσκολα πείθεται κανείς ότι η περιοχή είναι δημιούργημα\n"
                    "της μητέρας φύσης. Και όμως είναι! Σύμφωνα με τους ειδικούς, πριν από περίπου 50 με 60 εκατομμύρια χρόνια, στην περιοχή\n"
                    "Άντριμ της Βόρειας Ιρλανδίας, υπήρχε έντονη ηφαιστειακή δραστηριότητα. Οι πολυγωνικές στήλες, είναι από βασάλτη\n"
                    "(ηφαιστειογενές πέτρωμα), ο οποίος δημιουργείται με την πολύ γρήγορη ψύξη της καυτής λάβας. Όπως για όλα τα «περίεργα» που\n"
                    "έβλεπαν οι άνθρωποι και δεν μπορούσαν να εξηγήσουν με τη λογική , έτσι και για το «μονοπάτι του γίγαντα» υπάρχει ο θρύλος,\n"
                    "που «εξηγεί» τη δημιουργία των εντυπωσιακών εξάγωνων βράχων που θυμίζουν παξιμάδια. Σύμφωνα με την ιρλανδική παράδοση,\n"
                    "οι στήλες που σήμερα δεν σώζονται ολόκληρες, ήταν ένας υπερυψωμένος δρόμος, που έφτιαξε ο γίγαντας Φιν Μακ Κούλ. Ο Φιν\n"
                    " κάλεσε σε μονομαχία έναν άλλο γίγαντα από τη Σκωτία, τον Μπεναντόνερ και κατασκεύασε αυτό το υπερμέγεθες μονοπάτι για\n"
                    "να ενώσει τις δύο ακτές (Σκωτίας- Ιρλανδίας) ώστε να μπορέσουν να συναντηθούν και να δώσουν μάχη. Ο αντίπαλος αποδέχτηκε\n"
                    "την πρόσκληση και έφτασε στην περιοχή Άντριμ, όπου θα γινόταν η μονομαχία. Ο Φιν τον είδε από μακριά και συνειδητοποίησε\n"
                    "ότι ήταν πολύ μεγαλύτερος από ότι υπολόγιζε κι έτσι δίστασε να αναμετρηθεί μαζί του.</p>").add_to(map)

folium.Marker([51.501457480742715, -0.1418578154739384],
              popup="<h21> Παλάτι του Μπάγκινχαμ </h21><img src='buckingham.jpg' width=400px><p> Τα Ανάκτορα του Μπάκιγχαμ (αγγλικά: Buckingham Palace)\n"
                    " είναι βασιλική κατοικία στο Λονδίνο και η έδρα της βρετανικής μοναρχίας. Βρίσκονται κοντά στο Σαιντ Τζέιμς Παρκ στο Λονδίνο.\n"
                    "Κατασκευάστηκαν το 1703 για λογαριασμό του Σέφιλντ, δούκα του Μπάκιγχαμ, και αγοράστηκαν το 1761 από τον βασιλιά της Αγγλίας,\n"
                    "Γεώργιο τον Γ΄. Επί Γεωργίου Δ΄ το κτίριο δέχθηκε αρκετές αλλαγές αφού προστέθηκαν νέες πτέρυγες έτσι ώστε να διοργανώνει εκεί\n"
                    "ο Βασιλιάς τις επίσημες δεξιώσεις του. Την επέκταση ανέλαβε ο Τζον Νας ενώ λίγα χρόνια αργότερα, το 1847, προστέθηκε νέα πτέρυγα\n"
                    "στην ανατολική πλευρά των ανακτόρων από τον Έντουαρντ Μπλορ. Τα ανάκτορα διαθέτουν 602 δωμάτια, εκ των οποίων 19 είναι αίθουσες\n"
                    "τελετών, 52 βασιλικά δωμάτια και δωμάτια προσκεκλημένων, 188 δωμάτια προσωπικού και 78 μπάνια. Η Βασίλισσα Ελισάβετ Β΄ για τον\n"
                    "εαυτό της έχει κρατήσει 12 δωμάτια και έτσι οι επισκέπτες έχουν την δυνατότητα να περιηγηθούν στο μεγαλύτερο μέρος των ανακτόρων.\n"
                    " Τα δωμάτια και οι αίθουσες κοσμούνται με έργα τέχνης των Ρέμπραντ, Ρούμπενς, Βαττώ, Βαν Ντάικ κ.α. Τα ανάκτορα του Μπάκιγχαμ\n"
                    " άνοιξαν τις πύλες τους για το κοινό το 1993. </p>").add_to(map)

folium.Marker([41.40376668439198, 2.1743021534612432],
              popup="<h22> Αγία Οικογένεια </h22><img src='familia.jpg' width=400px><p> Η Σαγράδα Φαμίλια (ισπανικά: Basílica y Templo Expiatorio\n"
                    "de la Sagrada Familia, αγγλικά: Basilica and Expiatory Church of the Holy Family, ελληνικά: Βασιλική και Εξαγνιστική Εκκλησία\n"
                    "της Αγίας Οικογενείας) είναι μεγάλη ρωμαιοκαθολική εκκλησία στη Βαρκελώνη της Καταλονίας στην Ισπανία, σχεδιασμένη από τον Καταλανό\n"
                    " αρχιτέκτονα Αντόνι Γκαουντί (1852-1926). Αν και ημιτελής, η εκκλησία αποτελεί Μνημείο Παγκόσμιας Κληρονομιάς της UNESCO\n"
                    " και τον Νοέμβριο του 2010 εγκαινιάστηκε και καθαγιάστηκε από τον Πάπα Βενέδικτο ΙΣΤ΄ και έγινε βασιλική και μπορεί πλέον να\n"
                    "τελεστεί εκεί η Θεία Λειτουργία και να την παρακολουθήσουν οι πιστοί. Αν και η κατασκευή της Σαγράδα Φαμίλια είχε ξεκινήσει\n"
                    "το 1882, όταν το έργο ανέλαβε ο Γκαουντί το 1883, τη μεταμόρφωσε με το αρχιτεκτονικό και μηχανικό στυλ του συνδυάζοντας το\n"
                    "γοτθικό ρυθμό και μορφές μοντερνισμού με φιλόδοξες διαρθρωτικές κολόνες και αψίδες. Ο Γκαουντί αφιέρωσε τα τελευταία του\n"
                    "χρόνια στο έργο και όταν πέθανε το 1926, λιγότερο από το ένα τέταρτο του έργου είχε ολοκληρωθεί. Η κατασκευή της Σαγράδα\n"
                    " Φαμίλια προχώρησε με αργούς ρυθμούς καθώς βασιζόταν σε ιδιωτικές δωρεές, διακόπηκε από τον Ισπανικό Εμφύλιο και επανέκτησε\n"
                    "περιοδική πρόοδο τη δεκαετία του 1950. Η κατασκευή πέρασε τη μέση το 2010, με μερικές από τις μεγαλύτερες προκλήσεις να\n"
                    "παραμένουν και μια αναμενόμενη ημερομηνία ολοκλήρωσης το 2026 - επέτειος 100 χρόνων από τον θάνατο του Γκαουντί. Η\n"
                    "Σαγράδα Φαμίλια έχει διχάσει τους πολίτες της Βαρκελώνης για τους λόγους ότι συναγωνίζεται με τον Καθεδρικό Ναό της Βαρκελώνης\n"
                    ", για το σχέδιο του Γκαουντί και την πιθανότητα ότι η δουλειά που έγινε μετά τον θάνατό του δεν βασίστηκε στο σχέδιό του\n"
                    "και πιο πρόσφατα για το υπόγειο τούνελ ενός τρένου της Ισπανίας που μπορεί να διαταράξει τη σταθερότητα του κτιρίου. </p>").add_to(map)

folium.Marker([41.00562818418476, 28.976760153447543],
              popup="<h23> Μπλέ Τζαμί </h23><img src='bluemosque.jpg' width=400px><p>Το Μπλε Τζαμί ή Τζαμί του Σουλτάνου Αχμέτ, ή Αχμέτ Τζαμί,\n"
                    "ή Αχμετιέ Τζαμί (στα τούρκικα Sultanahmet Camii) είναι το ωραιότερο και μεγαλύτερο τζαμί στην Κωνσταντινούπολη, ξακουστό\n"
                    "και για την αρμονία του. Θεωρείται ένα από τα μεγαλύτερα αριστουργήματα της Ισλαμικής αρχιτεκτονικής παγκοσμίως και αρχιτέκτονάς\n"
                    " του υπήρξε ο Σεντεφχάρ Μεχμέτ Αγάς (Sedefhar Mehmet Ağa) μαθητής του Μιμάρ Σινάν .Το τζαμί χτίστηκε μεταξύ 1609 και 1616 με διαταγή\n"
                    "του σουλτάνου Αχμέτ Α' -από τον οποίο πήρε και το όνομά του- όταν αυτός ήταν σε ηλικία 20 ετών. Βρίσκεται στο παλαιότερο τμήμα της\n"
                    "Κωνσταντινούπολης, κοντά στην τοποθεσία του αρχαίου Ιππόδρομου (Ατ Μεϊντάνι), και απέναντι (δυτικά) από την Αγία Σοφία. Φωτογραφία\n"
                    "του 1903, με τον οβελίσκο του Θεοδοσίου (αριστερά) και την στήλη του Τρικάρηνου Όφι (δεξιά) στο προσκήνιο και στο βάθος το Μπλε Τζαμί\n"
                    "Είναι επίσης πολύ κοντά στο Τοπ Καπί, τόπο διαμονής των Σουλτάνων της Οθωμανικής Αυτοκρατορίας μέχρι το 1853, που είναι στη συνέχεια\n"
                    "της Αγίας Σοφιάς, ανατολικά, επί της ευρωπαϊκής ακτής του Βόσπορου. Για κάποιον που βλέπει την παραλία από τη θάλασσα, οι θόλοι και\n"
                    "οι μιναρέδες του Μπλε τζαμιού δίπλα στην Αγιά Σοφιά κυριαρχούν στη θέα της Κωνσταντινούπολης.Το τζαμί έγινε γνωστό στη Δύση σαν\n"
                    "Μπλε Τζαμί λόγω της κυριαρχίας του μπλε χρώματος στην εσωτερική του διακόσμηση. Παρόλα αυτά, το μπλε χρώμα δεν ήταν μέρος της αρχικής\n"
                    " διακόσμησης του τζαμιού και στις μέρες μας έχει ξεκινήσει η διαδικασία αφαίρεσής του. Σήμερα, το τζαμί δεν δίνει ιδιαίτερα την\n"
                    "εντύπωση του μπλε στους επισκέπτες. </p>").add_to(map)

folium.Marker([41.008777219224406, 28.980196438041595],
              popup="<h24> Αγία Σοφία </h24><img src='agiasofia.jpg' width=400px><p> Η Αγία Σοφιά ή Αγιά Σοφιά (λατινικά: Sancta Sophia ή Sancta Sapientia)\n"
                    ", επισήμως αποκαλούμενη εκκλησία της Αγίας Σοφίας (τουρκικά: Ayasofya-i Kebîr Câmi-i Şerîfi), γνωστή και ως Ναός της Αγίας\n"
                    " του Θεού Σοφίας ή απλά, η Μεγάλη Εκκλησία, είναι ιστορικός τόπος λατρείας της Κωνσταντινούπολης, ο οποίος λειτούργησε ως\n"
                    "χριστιανικός ναός από το 537 μέχρι το 1453. Στη συνέχεια μετετράπη σε ισλαμικό τέμενος και αργότερα (από το 1935) σε μουσείο.\n"
                    "Από το 2020, το τέμενος λειτουργεί πάλι ως τζαμί. Από το 537 (ο ομώνυμος ναός του 360 που είχε ανεγερθεί στο ίδιο σημείο,\n"
                    "απαλλοτριώθηκε προς θεμελίωση του υπάρχοντος) μέχρι το 1453 λειτουργούσε ως βυζαντινός χριστιανικός καθεδρικός ναός της πόλης,\n"
                    "με εξαίρεση την περίοδο 1204–1261, κατά την οποία ήταν ρωμαιοκαθολικός ναός. Μετά την άλωση της Κωνσταντινούπολης μετετράπη σε\n"
                    "ισλαμικό τέμενος, ενώ το 1934 σε μουσειακό χώρο (Ayasofya Müzesi). Στις 10 Ιουλίου 2020, ανακοινώθηκε η δεύτερη ιστορικά μετατροπή\n"
                    "του σε ισλαμικό τέμενος, από τον πρόεδρο της Τουρκίας. Στο σημείο όπου ανεγέρθηκε η Αγία Σοφία υπήρχε ομώνυμος ναός κτισμένος\n"
                    "επί Κωνσταντίνου Α΄ και Κωνσταντίνου Β΄, ο οποίος, όμως, κάηκε κατά τη Στάση του Νίκα (532 μ.Χ.). Ανήκει στις κορυφαίες δημιουργίες\n"
                    " της βυζαντινής ναοδομίας, όντας πρωτοποριακού σχεδιασμού και αρχιτεκτονικής συνθέσεως, και υπήρξε σύμβολο της πόλης, τόσο κατά τη\n"
                    "βυζαντινή όσο και κατά την οθωμανική περίοδο όσο και σήμερα. Το παρόν κτήριο ξεκίνησε να ανεγείρεται το 532 και εγκαινιάσθηκε στις\n"
                    "27 Δεκεμβρίου του 537, επί βασιλείας του Ιουστινιανού Α΄, από τους Μικρασιάτες μηχανικούς Ανθέμιο από τις Τράλλεις (σημ. Αϊδίνιο)\n"
                    " και Ισίδωρο από τη Μίλητο. Στο ίδιο σημείο, επί του πρώτου λόφου της Κωνσταντινούπολης και σε μικρή απόσταση από το Μέγα Παλάτιον\n"
                    "και τον Ιππόδρομο της πόλης, είχαν χτιστεί παλαιότερα δύο ακόμα ναοί που καταστράφηκαν, επίσης, από πυρκαγιά. Το οικοδόμημα ακολουθεί\n"
                    "τον αρχιτεκτονικό ρυθμό της τρουλαίας βασιλικής και συνδυάζει στοιχεία της πρώιμης βυζαντινής ναοδομίας, σε πολύ μεγάλη κλίμακα.\n"
                    "Αρχιτεκτονικές επιρροές της Αγίας Σοφίας εντοπίζονται σε αρκετούς μεταγενέστερους ορθόδοξους ναούς αλλά και σε οθωμανικά τζαμιά,\n"
                    " όπως στο τέμενος του Σουλεϊμάν και στο Σουλταναχμέτ τζαμί.[7] Εκτός από τον αρχιτεκτονικό σχεδιασμό της, η Αγία Σοφία ξεχωρίζει\n"
                    " επίσης για τον πλούσιο εσωτερικό διάκοσμό της, που ωστόσο υπέστη σοβαρές καταστροφές κυρίως από τους Τούρκους κατακτητές κατά τη\n"
                    "διάρκεια της Οθωμανικής κυριαρχίας. </p>").add_to(map)

folium.Marker([41.890385889031506, 12.492273812997254],
              popup="<h25> Κολοσσαίο της Ρώμης </h25><img src='colosseum.jpg' width=400px><p> Το Φλάβιο Αμφιθέατρο (λατινικά: Amphitheatrum Flavium),\n"
                    "από τον μεσαίωνα γνωστό ως το Κολοσσαίο (ιταλ. Colosseo) ήταν ένα αμφιθέατρο της Αρχαίας Ρώμης. Βρίσκεται στη ΝΑ. πλευρά της Ρωμαϊκής\n"
                    " Αγοράς (Forum Romanum). Το Κολοσσαίο άρχισε να κατασκευάζεται στην εποχή του Βεσπασιανός το 72 μ.Χ., συνεχίστηκε την εποχή του Τίτου\n"
                    " και ολοκληρώθηκε όταν ήταν αυτοκράτορας ο Τίτος, το 80 μ.Χ.. Ονομαζόταν Αμφιθέατρο των Φλαβίων, από το όνομα της δυναστείας των\n"
                    "αυτοκρατόρων που το έκτισαν. Για να κατασκευαστεί, εργάστηκαν χιλιάδες αιχμάλωτοι σκλάβοι όλων των εθνικοτήτων που είχαν συλληφθεί\n"
                    "από τον Τίτο μετά την καταστροφή των Ιεροσολύμων. Πήρε το όνομα του από το κολοσσιαίο άγαλμα του Νέρωνα (Ο Κολοσσός), που βρισκόταν\n"
                    " στην τοποθεσία που χτίστηκε. Η αρένα του Κολοσσαίου της Ρώμης. Μπορούσε να χωρέσει 65.000 θεατές και είχε σχήμα έλλειψης με\n"
                    "περιφέρεια 524 μέτρων. Οι διαστάσεις του ήταν κολοσσιαίες: 156 x 188 μέτρα και το ύψος του έφτανε τα 48 μέτρα και είχε 4 ορόφους.\n"
                    "Από αυτούς, οι τρεις πρώτοι είχαν αψίδες και ο τέταρτος 40 παράθυρα. Πάνω από τον 4ο όροφο υπήρχε στοά. Ο τελευταίος όροφος\n"
                    "προοριζόταν για τις γυναίκες και τις κατώτερες τάξεις των πολιτών, ενώ ο πρώτος για τους επιφανείς πολίτες.\n"
                    "Το εσωτερικό του ήταν χωρισμένο σε κερκίδες, ενώ στο κέντρο του είχε κονίστρα που χωριζόταν από τις κερκίδες με ένα ψηλό βάθρο.\n"
                    " Κάτω από την κονίστρα βρίσκονταν τα υπόγεια. Εκεί βρίσκονταν τα κλουβιά με τα ζώα, τα οποία μπορούσαν να ανυψωθούν για να ανεβαίνουν\n"
                    " τα ζώα στην αρένα, καθώς και οι μηχανικές συσκευές του κτηρίου. Πάνω από την αρένα υπήρχε μια μεγάλη τέντα, προκειμένου οι θεατές\n"
                    "να προστατεύονται από τον ήλιο. Οι θεατές έμπαιναν στο κτήριο μέσα από 80 εισόδους, 4 από τις οποίες χρησιμοποιούνταν αποκλειστικά\n"
                    "από τους Ρωμαίους γερουσιαστές και άρχοντες. Οι πολλές πύλες έδιναν στο Κολοσσαίο τη δυνατότητα να γεμίσει μέσα σε 15 λεπτά, και να\n"
                    "αδειάσει μέσα σε μόλις 5. Στην κονίστρα (αρένα) οδηγούσαν δύο πύλες: η πύλη της ζώσης σαρκός, από την οποία οι μονομάχοι εισέρχονταν\n"
                    "στην αρένα, και η «νεκρική πύλη», από την οποία απομακρύνονταν οι νεκροί της μάχης. Το Κολοσσαίο έμεινε θρυλικό ως το κέντρο των\n"
                    "αιμοφόρων θεαμάτων που απολάμβανε η ρωμαϊκή αυλή στην εποχή της παρακμής της. Η ορχήστρα είχε διαμορφωθεί κατάλληλα για να\n"
                    "πραγματοποιούνται ναυμαχίες, μονομαχίες και θηριομαχίες τις οποίες χρηματοδοτούσαν οι Ρωμαίοι αυτοκράτορες. Εκεί γίνονταν επίσης\n"
                    "μαρτύρια χριστιανών. </p>").add_to(map)

folium.Marker([13.750116324604827, 100.49161941231922],
              popup="<h26> Μεγάλο Παλάτι </h26><img src='palace.jpg' width=400px><p> Από την αρχαιότητα όλοι οι βασιλιάδες ζούσαν σε πολυτελείς\n"
                    "κατοικίες. Ο βασιλιάς της Ταϊλάνδης, Rama I (Phra Buddha Yodfa Chulalok) δεν ήταν εξαίρεση. Στο δεύτερο μισό του XVIII\n"
                    "αιώνα η πρωτεύουσα της Ταϊλάνδης μεταφέρθηκε από το Σιάμ στην Μπανγκόκ. Χωρίς αμφιβολία, μια νέα πρωτεύουσα χρειαζόταν\n"
                    "μια νέα βασιλική κατοικία, εντυπωσιακή με το μεγαλείο της. Έχοντας χτιστεί πριν από περισσότερα από διακόσια χρόνια, το\n"
                    "Μεγάλο Παλάτι στην Μπανγκόκ εξακολουθεί να εκπλήσσει με το μεγαλείο και την πολυτέλειά του. Χρησιμοποιείται ακόμα από τη\n"
                    "βασιλική οικογένεια. Φιλοξενεί ετήσιες βασιλικές τελετές, καθώς και βασιλικούς γάμους, κηδείες και κρατικές δεξιώσεις.\n"
                    "Ένα εντυπωσιακό αρχιτεκτονικό σύνολο βρίσκεται στην παλιά πόλη στο νησί Rattanakosin. Η κατασκευή του παλατιού ολοκληρώθηκε το\n"
                    "1785. Αποτελούνταν από πολλά ξύλινα κτίρια, που περιβάλλονταν από ένα ισχυρό προστατευτικό τείχος μήκους 1900 μέτρων.\n"
                    "Σιγά σιγά, οι ξύλινες κατασκευές αντικαταστάθηκαν με πέτρινα κτίρια, χτίστηκαν νέα εκπληκτικά κτίρια.</p>").add_to(map)

folium.Marker([40.68943648893471, -74.0444574870441],
              popup="<h27> Άγαλμα της Ελευθερίας </h27><img src='liberty.jpg' width=400px><p> Το Άγαλμα της Ελευθερίας, ή αλλιώς η Ελευθερία\n"
                    " που διαφωτίζει τον κόσμο είναι περίπου 90 μέτρα και εικονίζει την Ελευθερία ως γυναικεία μορφή, να κρατά στο υψωμένο\n"
                    "δεξί της χέρι έναν πυρσό και στο αριστερό της μια πλάκα στην οποία αναγράφεται η ημερομηνία «4 Ιουλίου 1776», η οποία\n"
                    "είναι η ημέρα ανεξαρτησίας των Ηνωμένων Πολιτειών. Το άγαλμα αυτό, είναι ένα δώρο από τη Γαλλία προς τις Ηνωμένες Πολιτείες\n"
                    "και δεσπόζει κοντά στην νησίδα Λίμπερτυ Άιλαντ (Liberty Island) στην είσοδο του λιμανιού της Νέας Υόρκης.Η ιδέα του αγάλματος\n"
                    "ανήκει στον Γάλλο ιστορικό Εντουάρ ντε Λαμπουλέ, ο οποίος πρότεινε να κατασκευαστεί ένα μνημείο προς τιμήν της γαλλοαμερικανικής\n"
                    " φιλίας. Το 1874, ο Φρεντερίκ Μπαρτολντί, έμπειρος γλύπτης, άρχισε να εργάζεται στο Παρίσι για την κατασκευή του\n"
                    "χρησιμοποιώντας ένα παλιότερο σχέδιό του που είχε απορριφθεί. Συγκεκριμένα ο Μπαρτολντί είχε προτείνει στην κυβέρνηση της\n"
                    "Αιγύπτου να χρηματοδοτήσει την κατασκευή ενός γιγάντiου αγάλματος στο πνεύμα του αρχαίου ελληνικού Κολοσσού της Ρόδου με\n"
                    "αφορμή τα εγκαίνια της διώρυγας του Σουέζ. Το άγαλμα θα αναπαριστούσε μια νεαρή Αιγύπτια χωρική με μαντήλα που θα κρατούσε\n"
                    " έναν πυρσό, θα τοποθετούνταν στο Πορτ Σάιντ και θα είχε τίτλο «η Αίγυπτος διαφωτίζει την Ασία». Αλλά η Αίγυπτος που είχε ήδη\n"
                    " επενδύσει τεράστια χρηματικά ποσά και πολύ χρόνο για την κατασκευή της διώρυγας αρνήθηκε να χρηματοδοτήσει το άγαλμα και\n"
                    "προτίμησε να χτίσει στη θέση του έναν φάρο ύψους 55 μέτρων. Όταν ο Λαμπουλέ πρότεινε στον Μπαρτολντί να κατασκευάσει ένα άγαλμα\n"
                    " για την γαλλοαμερικανική φιλία, ο Μπαρτολντί βρήκε την ευκαιρία να χρησιμοποιήσει το σχέδιό του και η Αιγύπτια φελάχα μετατράπηκε\n"
                    " σε κολοσσιαία θεά ενώ ο τίτλος του αγάλματος άλλαξε και έγινε «η Ελευθερία διαφωτίζει τον κόσμο».[3] Τη στατική δομή του\n"
                    "αγάλματος μελέτησε ο μηχανικός Γκυστάβ Άιφελ, για την κατασκευή ενός τεράστιου χαλύβδινου σκελετού. Τον σκελετό αυτό κάλυψε\n"
                    " ο Μπαρτολντί με φύλλα χαλκού σφυρηλατημένα στο χέρι για να δώσει στο άγαλμα την μορφή που ήθελε. Το κολοσσιαίο άγαλμα\n"
                    "αποσυναρμολογήθηκε σε 350 κομμάτια και μεταφέρθηκε στις ΗΠΑ το 1885, όπου συναρμολογήθηκε ξανά. </p>").add_to(map)

folium.Marker([30.328593289778027, 35.44436219730078],
              popup="<h28> Πέτρα της Ιορδανίας </h28><img src='petra.jpg' width=400px><p> Πέτρα, για αυτή την πόλη που είναι λαξευμένη μέσα στο βράχο\n"
                    "ο Τζον Μπέργκον έδωσε το χαρακτηρισμό «Η ροδοκόκκινη πόλη που είναι αρχαία σαν το μισό του χρόνου.» Το όνομα που χρησιμοποιούσαν\n"
                    "οι κάτοικοι της πόλης, οι Ναβαταίοι ή Ναμπάτου όπως τους αποκαλούσαν οι Μεσοποτάμιοι λαοί, ήταν Ράκμου που σημαίνει «Βράχος με\n"
                    "χρωματιστές ραβδώσεις». Σύμφωνα με τον αρχαίο Έλληνα ιστορικό του 4ου αιώνα π.Χ. Ιερώνυμο τον Καρδιανό, το όνομα Πέτρα δόθηκε\n"
                    " από τους Έλληνες εμπόρους επειδή οι κάτοικοι της πόλης γιόρταζαν την εποχή της άνοιξης μια θεότητα στην οποία προσέφεραν διάφορα\n"
                    "αγαθά, ως θυσία, πάνω σε μια μεγάλη πέτρα. Η μεγάλη αυτή πέτρα βρίσκεται νοτιοδυτικά της αρχαίας πόλης και σήμερα ονομάζεται\n"
                    "Ουμ-αλ-Μπιγιάρα. </p>").add_to(map)

folium.Marker([20.92231782942491, 107.18532214064078],
              popup="<h29> Κόλπος του Χα Λόνγκ </h29><img src='halong.jpg' width=400px><p> Ο Κόλπος Χα Λονγκ (Βιετναμέζικα: Vịnh Hạ Long) βρίσκεται\n"
                    " στο βόρειο Βιετνάμ. Ανήκει στον Κατάλογο των Μνημείων Παγκόσμιας Κληρονομιάς της UNESCO (από το 1992 για τo κριτήριο vii και\n"
                    "ξανά το 2000 για το κριτήριο viii [1]), στον κατάλογο Εθνικών Κειμήλιων και Τόπων του Βιετνάμ (από το 1962 [2]), ενώ αποτελεί\n"
                    "ένα δημοφιλή τουριστικό προορισμό στο Βιετνάμ. Διοικητικά ανήκει στην ομώνυμη πόλη Χα Λονγκ, την κωμόπολη Καμ Πχα (Cẩm Phả) και\n"
                    "ένα μέρος της περιοχής Βαν Ντον. Αποτελείται από χιλιάδες ασβεστολιθικά καρστ και νησίδες σε διάφορα μεγέθη και σχήματα. Ο κόλπος\n"
                    " Χα Λονγκ είναι το κέντρο μιας ευρύτερης ζώνης που περιλαμβάνει τον κόλπο Μπάι Του Λονγκ (Bái Tử Long) στα βορειοανατολικά και\n"
                    "τα νησιά Κατ Μπα (Cát Bà) στα νοτιοδυτικά. Σε αυτή την ευρύτερη ζώνη εμφανίζονται παρόμοια γεωλογικά, γεωγραφικά, γεωμορφολογικά,\n"
                    "κλιματικά, και πολιτιστικά χαρακτηριστικά. Το λιμάνι του Κόλπου Χα Λονγ Ο Χα Λονγκ έχει έκταση 1.553 χλμ2 περίπου, και\n"
                    "συμπεριλαμβάνει 1.960 νησίδες, οι περισσότερες από τις οποίες αποτελούνται από ασβεστόλιθο. Το κέντρο του κόλπου έχει έκταση\n"
                    "334 χλμ2, ενώ εμφανίζει υψηλή πυκνότητα με 775 νησίδες.[3] Οι ασβεστολιθικοί σχηματισμοί στον κόλπο έχουν ηλικία 500 εκατομμύρια\n"
                    "χρόνων. Η εξέλιξη των καρστικών φαινομένων διήρκεσαν 20 εκατομμύρια χρόνια, υπό την επίδραση του τροπικού υγρού κλίματος. Η\n"
                    "γεωποικιλότητα του περιβάλλοντος στην περιοχή έχει δημιουργήσει μια σημαντική βιοποικιλότητα. Ο Κόλπος Λα Χονγκ περιέχει 14 ενδημικά\n"
                    " φυτικά είδη [5] και 60 ενδημικά είδη πανίδας. Ιστορικές έρευνες έχουν δείξει την παρουσία ανθρώπου από την προϊστορική περίοδο,\n"
                    "δεκάδες χιλιάδες χρόνια πριν. Οι διαδοχικοί αρχαίοι πολιτισμοί που εμφανίστηκαν στην περιοχή είναι ο πολιτισμός Soi Nhụ\n("
                    "γύρω στο 18.000-7.000 π.Χ.), ο πολιτισμός Cái Bèo (7.000-5.000 π.Χ.)  και ο πολιτισμός Ha Long (5,000-3,500). "
                    "Ο Κόλπος έπαιξε σημαντικό ρόλο, επίσης, στην ιστορία του Βιετνάμ. </p>").add_to(map)

folium.Marker([51.17905685033189, -1.8262042731579857],
              popup="<h30> Στόουνχεντζ </h30><img src='stonehenge.jpg' width=400px><p> Το Στόουνχεντζ είναι νεολιθικό μεγαλιθικό μνημείο του οποίου\n"
                    "η διαμόρφωση συνεχίστηκε ως την Εποχή του Χαλκού, στην κομητεία του Γουΐλτσιρ (Wiltshire), περίπου 13 χλμ βορειοδυτικά του Σώλσμπερι\n"
                    " (Salisbury). Πρόκειται για έναν κύκλο μεγαλίθων, που κατασκευάστηκε σύμφωνα με τις πλέον αποδεκτές αρχαιολογικές εκτιμήσεις α\n"
                    "νάμεσα στο 2500 π.Χ. και το 2000 π.Χ.. Το αρχαιότερο κυκλικό ανάχωμα και η περιφερειακή τάφρος, που ανήκουν σε πρωιμότερη φάση\n"
                    "του μνημείου, χρονολογήθηκαν προσφάτως περί το 3100 π.Χ.. Το όνομα Στόουνχεντζ (Stonehenge) προέρχεται από τις αρχαίες αγγλικές\n"
                    "λέξεις Stanhen gist, που σημαίνουν 'κρεμαστοί λίθοι' και έδωσαν το όνομά τους σε μια ολόκληρη κατηγορία μνημείων γνωστών ως henge(s)\n"
                    ", δηλαδή κυκλικές ή οβάλ σχήματος περιοχές με διακριτά χαρακτηριστικά τους το κυκλικό ανάχωμα και την τάφρο που το περιβάλλει.\n"
                    "Οι αρχαιολόγοι καθορίζουν τα henge(s) ως εκχωματώσεις που συνίστανται από ένα κυκλικό έγκλεισμα, περιβεβλημένο με κρηπιδωμένη\n"
                    "κυκλική τάφρο. Όπως συμβαίνει συχνά με την αρχαιολογική ορολογία, η λέξη είναι δάνεια από τους παλιούς αρχαιοδίφες. Όμως, ο όρος\n"
                    "henge δεν είναι και ο καταλληλότερος για την περιγραφή του Στόουνχεντζ, στην περίπτωση του οποίου το κρηπίδωμα βρίσκεται εσωτερικά\n"
                    "της τάφρου. Παρόλο που το Στόουνχεντζ ως μνημείο είναι σύγχρονο άλλων τυπικότερων. Το σύνολό του δεν είναι δυνατόν να καταχωρηθεί\n"
                    "σε κάποια κατηγορία. Μορφολογικά έχει μακρινή μόνον συγγένεια με τους υπόλοιπους λίθινους κύκλους των Βρετανικών νήσων, όπως ο\n"
                    "κύκλος του Μπρόντγκαρ (Ring of Brodgar), για παράδειγμα, ενώ τα περίφημα τρίλιθά του το καθιστούν μοναδικό. Το Στόουνχεντζ και\n"
                    "ο περιβάλλων χώρος του προστέθηκαν στον κατάλογο της UNESCO για την Παγκόσμια Πολιτισμική Κληρονομιά το 1986. </p>").add_to(map)



#κατεστραμμέα μνημεία

#Εδώ υπάρχει διαφορά στην προσθήκη. Συγκεκριμένα, επιλέγεται το μαύρο χρώμα για το marker, όπως φαίνεται στο σημείο folium.Icon(color='black')
folium.Marker([40.71150096692943, -74.01313313809663],
              popup="<h31> Δίδυμοι Πύργοι </31><img src='twintowers.jpg' width=400px><p> Το αρχικό Παγκόσμιο Κέντρο Εμπορίου (αγγλικά: World Trade Center)\n"
                    " ήταν ένα σύμπλεγμα επτά κτιρίων στο Μανχάταν της Νέας Υόρκης στις Ηνωμένες Πολιτείες Αμερικής. Στο σύμπλεγμα αυτό, συμπεριλαμβάνονται\n"
                    " και δύο ουρανοξύστες-ορόσημα, τα Παγκόσμιο Κέντρο Εμπορίου 1 και 2 (1 World Trade Center, 2 World Trade Center) που ήταν ευρέως\n"
                    "γνωστοί ως Δίδυμοι Πύργοι (Twin Towers), διότι επρόκειτο για δύο κτίρια με μεγάλες εξωτερικές ομοιότητες. Το σύμπλεγμα καταστράφηκε\n"
                    "κατά τις επιθέσεις της 11ης Σεπτεμβρίου 2001, με τους δύο πύργους και το Παγκόσμιο Κέντρο Εμπορίου 7 να καταρρέουν. Τα υπόλοιπα\n"
                    "κτίρια του συμπλέγματος καταστράφηκαν μερικώς από από την κατάρρευση των πύργων και τελικά, κατεδαφίστηκαν. Το Παγκόσμιο Κέντρο\n"
                    "Εμπορίου δίπλα στο Παγκόσμιο Οικονομικό Κέντρο και το Battery Park City.Το πρωί της 11ης Σεπτεμβρίου του 2001, μέλη της Αλ-Κάιντα\n"
                    "συνέτριψαν δύο αεροπλάνα Boeing 767 στους ουρανοξύστες του συμπλέγματος (στις 8:46 στο Παγκόσμιο Κέντρο Εμπορίου 1 και στις 9:03\n"
                    "στο Παγκόσμιο Κέντρο Εμπορίου 2), προκαλώντας την ολοσχερή κατάρρευση τους μετά από 85 και 56 λεπτά φωτιάς αντίστοιχα. Υπολογίζεται\n"
                    " ότι σκοτώθηκαν 2.977 άτομα, συμπεριλαμβάνοντας τα 157 άτομα στα αεροσκάφη και τους πάνω από 250 νεκρούς πυροσβέστες. Συντρίμμια\n"
                    " που έπεσαν από την κατάρρευση προκάλεσαν μεγάλες ζημιές σε κοντινά κτίρια, όπως στο Deutsche Bank Building και το Παγκόσμιο \n"
                    "Κέντρο Εμπορίου 7, το οποίο και κατέρρευσε. Η διαδικασία καθαρισμού των συντριμμιών διήρκεσε 8 μήνες και ο αέρας στην περιοχή \n"
                    "χρειάστηκε 9 μήνες για να επανέλθει στην προηγούμενη χημική του σύσταση.  </p>",
              icon=folium.Icon(color='black')).add_to(map)

folium.Marker([34.56915229668598, 38.30117162325604],
              popup="<h32> Παλμύρα </32><img src='palmyra.jpg' width=400px><p> Η Παλμύρα υπήρξε κατά την αρχαιότητα σημαντική πόλη της κεντρικής Συρίας,\n"
                    " κτισμένη σε μία όαση 215 χιλιόμετρα βορειοανατολικά της Δαμασκού και 120 χιλιόμετρα νοτιοδυτικά του Ευφράτη. Για αιώνες\n"
                    "ήταν ζωτικός σταθμός για τα καραβάνια που διέσχιζαν τη Συριακή έρημο και ήταν γνωστή ως η «Νύμφη της Ερήμου». Το ελληνικό\n"
                    "όνομα «Παλμύρα» αποτελεί μετάφραση του αρχικού αραμαϊκού ονόματος Tadmor, που σημαίνει «φοινίκια πόλη». Η σύγχρονη κωμόπολη\n"
                    " δίπλα στα αρχαία ερείπια ονομάζεται και πάλι Tadmor. Η οικονομία της εξαρτάται από τον τουρισμό. Στη Βίβλο αναφέρεται ως\n"
                    "Ταμάρ ή Θεδμόρ ή Θοεδμόρ ενώ στα αραμαϊκά Ταδμόρ ή Ταμμόρ και που λέγεται πως έκτισε ο Βασιλιάς Σολομών ως πόλη σταθμό των\n"
                    "καραβανιών μεταξύ Συρίας και Μεσοποταμίας. </p>",
              icon=folium.Icon(color='black')).add_to(map)

folium.Marker([34.83229218762095, 67.82673672099764],
              popup="<h33> Αγάλματα του Βούδα </33><img src='buddha.jpg' width=400px><p>Τα αγάλματα του Βούδα στην κοιλάδα του Μπαμιγιάν στο Αφγανιστάν\n"
                    " ήταν ιερά έργα ελληνοβουδιστικής τέχνης της εποχής του 3ου ως 10ου αιώνα. Βρίσκονταν λαξευμένα στους βράχους της κοιλάδας\n"
                    "του Μπαμιγιάν σε υψόμετρο 2.500 μέτρων. Ήταν μοναδικά στο είδος τους και τα μεγαλύτερα αγάλματα παγκοσμίως που αναπαρίσταναν τον\n"
                    "Βούδα ιστάμενο. Το μεγαλύτερο είχε ύψος 53 και το μικρότερο 35 μέτρα, ενώ πλήθος από σπηλιές με τοιχογραφίες και καθιστές μορφές\n"
                    "βούδα, συμπλήρωναν το τοπίο. Η κυβέρνηση των Ταλιμπάν τα ανακήρυξε επίσημα ως «είδωλα» και ακολούθως ανατινάχτηκαν με δυναμίτη\n"
                    "τον Μάρτιο του 2001. </p>",
              icon=folium.Icon(color='black')).add_to(map)

folium.Marker([35.89658869510023, 14.5103045667756],
              popup="<h34> Όπερα της Βαλέττας </34><img src='maltaopera.jpg' width=400px><p> Η Βασιλική Όπερα της Βαλέτας, γνωστή επίσης και ως\n"
                    "Βασιλικό Θέατρο, ήταν ένα μέγαρο όπερας και χώρος τέχνης στη Βαλέτα της Μάλτας. Σχεδιάστηκε από τον Άγγλο αρχιτέκτονα Έντουαρντ\n"
                    " Μίντλετον Μπάρι και ανεγέρθη το 1866. Το 1873 υπέστη σοβαρές ζημιές στο εσωτερικό της λόγω μιας πυρκαγιάς, της\n"
                    "οποίας οι συνέπειες αποκαταστάθηκαν το 1877. Κατά τη διάρκεια του Β΄ Παγκοσμίου Πολέμου, το 1942 δέχτηκε σφοδρό αεροπορικό\n"
                    "βομβαρδισμό. Πριν την καταστροφή του, ήταν ένα από τα εντυπωσιακότερα κτήρια στη Βαλέτα. Είχε μήκος 63 μέτρα, πλάτος 34 μέτρα\n"
                    " και χωρητικότητα θεατών 1.095 καθισμένων και 200 όρθιων. Μετά το βομβαρδισμό, η πρόσοψη και η κεντρική αίθουσα ήταν ένας σωρός\n"
                    "από πέτρες, ενώ η στέγη είχε καταρρεύσει. Ωστόσο, το πίσω άκρο που ξεκινούσε από την κιονοστοιχία έμεινε ανέπαφο. Ορισμένες δομές\n"
                    "του κτιρίου κατεδαφίστηκαν στα τέλη της δεκαετίας του 1950 για λόγους ασφαλείας. Έπειτα από μια σειρά από αποτυχημένα σχέδια για\n"
                    " την ανοικοδόμηση του θεάτρου, το 2006 η κυβέρνηση ανακοίνωσε την πρόθεσή της να προχωρήσει στην ανάπλαση του χώρου και να μεταφέρει\n"
                    " εκεί το κοινοβούλιο της χώρας, το οποίο στεγαζόταν τότε στο πρώην Οπλοστάσιο του Παλατιού του Μεγάλου Μάγιστρου. Η πρόταση δεν\n"
                    "έλαβε ιδιαίτερα θετική ανταπόκριση, δεδομένου ότι ανέκαθεν θεωρούνταν ότι ο χώρος έπρεπε να στεγάζει κάποιο πολιτιστικό κέντρο.\n"
                    "Ωστόσο, ο Ιταλός αρχιτέκτονας Ρέντσο Πιάνο προσεγγίστηκε από την κυβέρνηση και ξεκίνησε μελέτες για την ανακατασκευή του πρώην\n"
                    "θεάτρου. Το 2008 η κυβέρνηση ανακοίνωσε τον προϋπολογισμό του έργου, ύψους 80 εκατομμυρίων ευρώ. Ο Πιάνο αποθάρρυνε την κυβέρνηση\n"
                    " από το να χτίσει το νέο κοινοβούλιο στο χώρο της όπερας και αντιπρότεινε το χώρο απέναντι απο αυτή με μια ταυτόχρονη ανάπλαση\n"
                    "της ευρύτερης περιοχής. Η πρόταση του Πιάνο που τελικώς έγινε αποδεκτή ήταν η μετατροπή του χώρου της πρώην όπερας σε ένα υπαίθριο\n"
                    " θέατρο. Η ανάπτυξη του θεάτρου από τον Πιάνο εκείνη την εποχή προκάλεσε έντονες συζητήσεις.Η κυβέρνηση συνέχισε τα σχέδια και\n"
                    "το υπαίθριο θέατρο εγκαινιάστηκε επισήμως στις 8 Αυγούστου 2013. Το θέατρο ονομάστηκε «Pjazza Teatru Rjal» (δηλ. Πλατεία Βασιλικού\n"
                    " Θεάτρου), προς τιμήν του αρχικού κτιρίου της όπερας. </p>",
              icon=folium.Icon(color='black')).add_to(map)

folium.Marker([37.8825200471303, 58.333313869112146],
              popup="<h40> Μνημείο της Ουδετερότητας </40><img src='neutrality.jpg' width=400px><p> Το Μνημείο της Ουδετερότητας\n"
                    "(τουρκμενικά: Bitaraplyk arkasy) ήταν μνημείο που βρισκόταν στην Ασγκαμπάτ του Τουρκμενιστάν. Το τόξο τριών ποδιών,\n"
                    "το οποίο έγινε γνωστό ως Το Τρίποδο, ήταν 75 μέτρα ψηλό και χτίστηκε το 1998, σχετικά με τις διαταγές του Προέδρου του\n"
                    "Τουρκμενιστάν Σαπαρμουράτ Νιγιαζόφ για να τιμήσει την επίσημη θέση της ουδετερότητας της  χώρας. Η κατασκευή κόστισε\n"
                    " 12 εκατομμύρια δολάρια. Το μνημείο ολοκληρωνόταν από ένα ψηλό επίχρυσο άγαλμα του Νιγιαζόφ ύψους 12 μέτρων που περιστρεφόταν\n"
                    " για πάντα προς το πρόσωπο του ήλιου. Η αψίδα βρισκόταν στη κεντρική Ασγκαμπάτ, όπου κυριαρχούσε στον ορίζοντα, και ήταν\n"
                    "ψηλότερο από το κοντινό Προεδρικό μέγαρο. Το άγαλμα ήταν φωτισμένο το βράδυ. Η αψίδα χαρακτηριζόταν από μια πλατφόρμα πανοραμικής\n"
                    "προβολής, η οποία ήταν ένα δημοφιλές αξιοθέατο για τους επισκέπτες.</p>",
              icon=folium.Icon(color='black')).add_to(map)


#λιγότερο γνωστά μνημεία/αξιοθέατα

#Εδώ υπάρχει διαφορά στην προσθήκη. Συγκεκριμένα, επιλέγεται το πράσινο χρώμα για το marker, όπως φαίνεται στο σημείο folium.Icon(color='green')
folium.Marker([39.83428428740267, -104.67622971788556],
              popup="<h35> Μπλέ Άγριος Ίππος </35><img src='bluemustang.png' width=400px><p> Ο μπλέ άγριος ίππος είναι ένα άγαλμα στο αεροδρόμιο του\n"
                    "Ντένβερ των Ηνωμένων Πολιτειών. Τοποθετήθηκε εκεί το 2008, αρκετά χρόνια μετά την αρχή του έργου το 1992\n"
                    "καθώς προέκυψαν διάφορες καθυστερήσεις. Έχει χαρακτηριστεί και ως Blucifer, λόγω της εμφάνισης του και συγκεκριμένα των\n"
                    "φωτεινών κόκκινων ματιών του, αλλά και επειδή το 2006 ο δημιουργός του Λουίζ Χιμένεθ σκοτώθηκε στο εργαστήρι του\n"
                    "όταν ένα κομμάτι του τότε υπό κατασκευή αγάλματος έπεσε πάνω του. Πρίν από αυτό, ο γλύπτης κατά την κατασκευή του,\n"
                    "υπέφερε από διάφορα προβλήματα υγείας αλλά και προβλήματα με την πόλη όπου βρίσκεται το άγαλμα καθώς υπήρξαν\n"
                    "υποβολές μήνυσης διότι το έργο δεν είχε παραδοθεί στην ώρα του. </p>",
              icon=folium.Icon(color='green')).add_to(map)



folium.Marker([60.33945705137937, 5.353311456430147],
              popup="<h36> Εκκλησία του Φαντόφτ </36><img src='fantoft.jpg' width=400px><p> Η εκκλησία του Φαντόφτ στην Νορβηγία είναι ανακατασκευασμένη\n"
                    "εκκλησία στο Μπέργκεν της Νορβηγίας. Η πρώτη εκκλησία είχε κατασκευαστεί το 1150 στο Σόννεφιορντ της Νορβηγίας και το 1879 η νέα\n"
                    "εκκλησία του Fortun χτίστηκε με σκοπό την αντικατάσταση της πρώτης εκκλησίας. Έτσι, επειδή η πρώτη εκκλησία λόγω του τύπου της\n"
                    "(μεσαιωνική ξύλινη, γνωστή ως Stave Church, δηλαδή εκκλησία με 'πέδιλα΄) απειλήθηκε με κατεδάφιση, κομμάτια της μεταφέρθηκαν στο\n"
                    "Φάνα της Νορβηγίας. Το 1992, η εκκλησία ήταν θύμα εμπρηστικής επίθεσης από μέλη της σκηνής του Black Metal της Νορβηγίας, καθώς\n"
                    "εκείνη την περίοδο ήταν η περίοδος όπου η συγκεκριμένη σκηνή γνώριζε άνθηση και ξεκίνησε μια σειρά εμπρησμών σε εκκλησίες της χώρας.\n"
                    "Σύντομα μετά την καταστροφή, ξεκίνησε η επανοικοδόμηση της και ολοκληρώθηκε το 1997.  </p>",
              icon=folium.Icon(color='green')).add_to(map)

folium.Marker([36.875868257758555, 27.25703081140964],
              popup="<h37> Ασκληπιείο της Κω </37><img src='kos.jpg' width=400px><p> Το Ασκληπιείο της Κω είναι κτισμένο στις πλαγιές ενός λοφίσκου με\n"
                    "πλούσια βλάστηση και θέα στη θάλασσα και τις Μικρασιάτικες ακτές. Αποτελεί το σπουδαιότερο αρχαιολογικό μνημείο του νησιού, αλλά\n"
                    " και ένα από τα πιο φημισμένα ασκληπιεία της αρχαιότητας. Στους αρχαίους χρόνους αποτελούσε χώρο λατρείας του θεού Ασκληπιού και\n"
                    " χώρο θεραπείας αλλά και διδασκαλίας της Ιατρικής. Εκεί δίδαξε ο Ιπποκράτης, ένας από τους σημαντικότερους εκπροσώπους της ιατρικής\n"
                    " κατά την αρχαιότητα, στη σχολή που είχε ιδρύσει ο ίδιος στο χώρο του Ασκληπιείου. Σε αντίθεση με το ιερό του Ασκληπιού στην\n"
                    "Επίδαυρο, στην Κω αναπτύχθηκε ιδιαίτερα η επιστημονική ιατρική.Τα Ασκληπιείο της Κω, του οποίου τα σωζόμενα ερείπια χρονολογούνται\n"
                    "μετά τον 4ο αιώνα π.Χ, βρίσκεται νοτιοδυτικά της σημερινής πόλης της Κω σε απόσταση περίπου 3,4 χιλιομέτρων. Χρονολογείται στην\n"
                    "Ελληνιστική εποχή, άποψη που ενισχύεται από την εκμετάλλευση του χώρου που παρουσιάζουν τα τρία αλλεπάλληλα επίπεδα - στοιχείο\n"
                    "ανατολίτικης αρχιτεκτονικής που εισχώρησε στην ελληνική αρχιτεκτονική με τις κατακτήσεις του Μεγάλου Αλεξάνδρου. Ένα καθοριστικό\n"
                    " γεγονός που συνέβη στην Κω κατά την περίοδο της βασιλείας των Πτολεμαίων, το 260 π.Χ., ήταν η πανελλήνια αναγνώριση του δικαιώματος\n"
                    " της ασυλίας του ιερού χώρου του Ασκληπιού για την καθιέρωση του πανηγυρικού εορτασμού την Μεγάλων Ασκληπιείων. Η επιδίωξη από τους\n"
                    "Κείους της παραχώρησης ασύλου σε κάθε καταδιωγμένο που ζήταγε προστασία στο Ασκληπιείο φανερώνει πόσο περήφανοι ένοιωθαν οι Κείοι για\n"
                    "την ύπαρξή του, θεωρώντας συνάμα τον ναό ως κέντρο της πόλης τους. Η ανακάλυψη του Ασκληπιείου έγινε το 1902 από τον Γερμανό\n"
                    " αρχαιολόγο Rudolf Herzog και τον Κείο ιστοριοδίφη Ιάκωβο Ζαρράφτη, ο οποίος μάλιστα υπολόγισε και υπέδειξε την ορθή θέση του\n"
                    " ιερού. </p>",
              icon=folium.Icon(color='green')).add_to(map)

folium.Marker([36.44594971999421, 28.22405821139728],
              popup="<h38> Παλάτι του μεγάλου Μαγίστρου των Ιπποτών της Ρόδου </38><img src='rhodespalace.jpg' width=400px><p> Το Παλάτι του\n"
                    "Μεγάλου Μαγίστρου των ιπποτών ή Καστέλο βρίσκεται στην βορειοδυτική πλευρά της μεσαιωνικής πόλης της Ρόδου στο ψηλότερο\n"
                    " σημείο του κάστρου και αποτελεί το σημαντικότερο ίσως μνημείο της περιόδου των ιπποτών. Το Παλάτι του Μεγάλου Μαγίστρου είναι\n"
                    "κτίσμα του 14ου αιώνα που κατασκευάστηκε από τους Ιωαννίτες ιππότες, οι οποίοι κατείχαν τη Ρόδο και ορισμένα άλλα νησιά όπως\n"
                    "το Καστελόριζο από το 1309 έως το 1522, στη θέση παλαιότερης βυζαντινής ακρόπολης του 7ου μ.Χ. αιώνα. Σύμφωνα με νεότερες\n"
                    "έρευνες στη θέση του, βρισκόταν ο ιερός ναός του θεού Ήλιου και σε αυτή την θέση πιθανόν να είχε στηθεί ο περίφημος Κολοσσός\n"
                    "της Ρόδου σε αντίθεση με την προγενέστερη πεποίθηση ότι βρισκόταν στην περιοχή Μανδράκι, που βρίσκεται στη θέση του ενός\n"
                    "εκ των τριών λιμανιών της Ρόδου. Το παλάτι εκτός από διοικητικό κέντρο των Ιπποτών και κατοικία του Μεγάλου Μαγίστρου ήταν\n"
                    "επίσης έδρα της άρχουσας κοινωνικής και πνευματικής τάξης της Ρόδου.</p>",
              icon=folium.Icon(color='green')).add_to(map)

folium.Marker([36.96562862613049, 26.95034562675872],
              popup="<h39> Παλαιοχριστιανική βασιλική του Χριστού της Ιερουσαλήμ </39><img src='kalymnos.jpg' width=400px><p> Ο Χριστός της Ιερουσαλήμ\n"
                    " είναι μία τρίκλιτη παλαιοχριστιανική βασιλική, που βρίσκεται στην περιοχή Λιμνιώτισσα, σε απόσταση 200 μ. δυτικά της Χώρας Καλύμνου,\n"
                    " δίπλα στην ασφαλτοστρωμένη οδό που οδηγεί από τη Χώρα προς τον Πάνορμο. Στην ευρύτερη περιοχή όπου περιλαμβάνεται και η\n"
                    "παλαιοχριστιανική βασιλική του Χριστού της Ιερουσαλήμ απλωνόταν κατά τους προχριστιανικούς χρόνους το τέμενος του Δηλίου Απόλλωνος,\n"
                    " του προστάτη και πολιούχου θεού της Καλύμνου. Σύμφωνα με επιγραφικές μαρτυρίες ο χώρος αποτελούσε το πολιτικό και θρησκευτικό κέντρο\n"
                    "της αρχαίας Καλύμνου. Εδώ υπήρχαν οι ναοί του Απόλλωνα και του Ασκληπιού, Θέατρο, Γυμνάσιο, Βουλευτήριο. Η επικράτηση του\n"
                    " χριστιανισμού μετά από τους διωγμούς των Ρωμαίων αυτοκρατόρων επέφερε το κλείσιμο και την καταστροφή του Ιερού.\n"
                    "Η βασιλική οικοδομήθηκε τον 5ο αι. μ.Χ., καταστράφηκε πιθανότατα στα μέσα του 6ου αι. από σεισμό και επισκευάστηκε στη συνέχεια,\n"
                    " ενώ 40 μ. νοτιοανατολικά της οικοδομείται μία ακόμη βασιλική, η Αγία Σοφία. Τον 7ο αι. εγκαταλείπεται λόγω των αραβικών επιδρομών.\n"
                    "Από τη βασιλική του Χριστού της Ιερουσαλήμ έχει αποκαλυφθεί μόνο το ανατολικό τμήμα από τις ανασκαφές του Άγγλου Ch. Newton και του\n"
                    "Ιταλού M. Serge το 1937. Σε καλή κατάσταση διατηρείται η αψίδα του ιερού βήματος σε ολόκληρο το ύψος της. Ως οικοδομικό υλικό έχουν\n"
                    "χρησιμοποιηθεί αρχιτεκτονικά μέλη και ενεπίγραφοι δόμοι από οικοδομήματα του αρχαίου ιερού του Δηλίου Απόλλωνα που προϋπήρχε στον\n"
                    "ίδιο χώρο. Το κεντρικό κλίτος είναι στρωμένο με μεγάλες μαρμάρινες πλάκες, ενώ το νότιο καλύπτεται με ψηφιδωτή σύνθεση που\n"
                    "περιλαμβάνει ζώα μέσα σε φυσικό περιβάλλον.</p>",
              icon=folium.Icon(color='green')).add_to(map)

map.save('map.html')
#Αποθήκευση των marker στον χάρτη και δημιουργία του αρχείου map.html για να εμφανιστεί ο χάρτης